[
{"name": "Aquatic Ring of Resistance", "info": [" varies: +1- 1,500 gp; +2- 6,000 gp; +3- 13,500 gp; +4- 24,000 gp; +5- 37,500 gp; ", " ring; ", " 5th; ", " —; ", " faint ", "DESCRIPTION", "Races that dwell in the depths avoid wearing flowing garments such as cloaks that could get tangled while swimming underwater, and for this reason, some of their magic items are worn in different magic item slots than surface-dwellers are used to.", "Protective symbols adorn this magic ring. It functions as a ", " with an equivalent bonus.", "CONSTRUCTION REQUIREMENTS", " varies: +1- 750 gp; +2- 3,000 gp; +3- 6,750 gp; +4- 12,000 gp; +5- 17,750 gp; ", " ", "; ", " ", "; ", " creator’s ", " must be at least three times the ring’s bonus", " © 2017, Paizo Inc.; Authors: Mikko Kallio, with John Compton, Adam Daigle, Kalervo Oikarinen, and David Schwartz."]},
{"name": "Blight Siphoner", "info": [" 2,200 gp; ", " none; ", " 5th ", " —; ", " faint ", "APPEARANCE", "This glass needle is surrounded by a floating, spiraling glass tube and can easily hook onto ", ", clothing, or jewelry.", "EFFECTS", "As an ", ", as long as the wearer of the blight siphoner has one hand free and has the needle within easy reach, she can stab herself with the needle when she attempts a ", " saving throw against a ", " she has contracted. This grants the user a +2 ", " on that saving throw. In addition, if the user succeeds at the saving throw, it counts as two consecutive saves for the purpose of curing the ", ". Once the user has succeeded at a saving throw against a disease using the blight siphoner, the needle shatters and the item is destroyed.", "CONSTRUCTION REQUIREMENTS", " 1,100 gp; ", " ", "; ", " ", " © 2018, Paizo Inc.; Authors: John Compton, Eleanor Ferron, Thurston Hillman, Nathan King, Isabelle Lee, Jacob W. Michaels, Adrian Ng, David N. Ross, and Mike Welham."]},
{"name": "Dark Life Ring", "info": [" 1,250 gp; ", " ring; ", " 3rd; ", " —; ", " faint ", "DESCRIPTION", "A dark life ring grants its wearer a +2 ", " on ", " saving throws against channeled negative energy and inflict spells (any spell with “inflict” in its name). In addition, anytime the wearer takes damage from channeled negative energy or an inflict spell, she subtracts 5 from the damage taken (calculated after the wearer has rolled her ", " save against the effect), to a minimum of 0 points of damage.", "CONSTRUCTION REQUIREMENTS", " 625 gp; ", " ", "; ", " ", " © 2014, Paizo Inc.; Authors: Paris Crenshaw, Jim Groves, Sean McGowen, and Philip Minchin."]},
{"name": "Envoy Ring", "info": [" ring; ", " 11th; ", " — ", " moderate ", "DESCRIPTION", "This golden ring appears perfect on the outside, but the inside shows centuries of wear. A family crest adorns the front, depicting olive branches encircling two crowns, which seemingly indicates a house dedicated to ambassadorship and diplomacy.", "EFFECTS", "When first donned, it provides only its baseline abilities; the PCs must achieve some glory to unlock the additional abilities listed under the First Triumph entry.", "The ring grants its wearer a +2 ", " on ", ", ", ", and ", " checks. Once per day, the wearer can speak a ", " word to transform her appearance and clothing, as per ", ". The appearance of her clothing automatically matches the customs of the dominant culture around her, typically that of the local nobility or ruling class. Her physical features don’t match those of the local people, but features that would make her stand out diminish, such as ", " ears in a settlement where no ", " live. This lasts up to 24 hours, but can be dismissed at any time.", "The ", " of any spell effect generated by the ring is 1 + 2 per triumph attained.", ": The ring can be activated to cast ", " (DC = 15 + 1 per additional triumph attained) and ", " each once per day.", " © 2018, Paizo Inc.; Authors: Thurston Hillman, with Eleanor Ferron, Crystal Frasier, and Adrian Ng."]},
{"name": "Band of Triumph", "info": [" 50,000 gp; ", " ring; ", " 13th; ", " —; ", " strong ", " and ", "APPEARANCE", "This white-gold ring bears the relief image of a roaring lion.", "BENEFITS", "Once per day on command, the wearer can point the ring and mentally designate one or more creatures or objects in a 60-foot cone as enemies, after which the ring roars triumphantly. Selected targets in the area are affected by ", " (", " DC 20). All other objects in the area are unharmed, and all other creatures in the area receive the benefits of the ", " ", " as performed by a 7thlevel ", " for 3 rounds. When activating the ring, the wearer can expend 1 round of her ", " ability to use her own ", " level to calculate the performance’s effect.", "In addition, the ring grants the wearer a +4 ", " to ", "; treat this as a temporary ability bonus for the first 24 hours the ring is worn.", "CONSTRUCTION REQUIREMENTS", " 25,000 gp; ", " ", "; ", " ", ", ", ", ", " © 2018, Paizo Inc.; Authors: John Compton, with Jason Keeley, Nathan King, Crystal Malarsky, and Greg A. Vaughan."]},
{"name": "Heavenly Aegis Ring", "info": [" 16,000 gp; ", " ring; ", " 10th; ", " — ", " moderate ", " [good]", "DESCRIPTION", "The surface of this silver ring never tarnishes, but when an evil creature is wearing it, its luster diminishes.", "Whenever the wearer takes the ", " action, he can ", " the ring, creating a ", " effect centered on him. This effect lasts 10 rounds per day, though the rounds don’t need to be spent consecutively. Once activated, the effect expends rounds until the user ends it as a ", " or the rounds run out.", "As a ", " while the magic circle is active, the wearer can release the protective circle’s energy as a violent blast. This functions as ", " centered on the wearer, but the wearer can exclude a 10-foot-radius area from the center of the affected area.", "Releasing the energy expends all the ring’s remaining rounds and can be done only if at least 5 rounds remain.", "The ring’s power renews each day at dawn.", "CONSTRUCTION REQUIREMENTS", " 8,000 gp; ", " ", "; ", " ", ", ", " © 2016, Paizo Inc.; Authors: John Bennett, Clinton J. Boomer, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Jim Groves, Steven Helt, Thurston Hillman, Eric Hindley, Brandon Hodge, Mikko Kallio, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Alistair Rigg, Alex Riggs, David N. Ross, F. Wesley Schneider, David Schwartz, Mark Seifter, and Linda Zayas-Palmer."]},
{"name": "Communique Rings", "info": [" 6,000 gp; ", " ring; ", " 6th; ", " —; ", " moderate ", "DESCRIPTION", "Created in pairs, these simple golden rings allow for short-range communication between the wearers. The listed price and cost are for both rings. As long as the wearers are within 1 mile of one another, they can communicate by whispering, causing the other ring to whisper the words to the recipient. Words spoken into or recited by a communique ring can be heard by nearby creatures if the wearer speaks too loudly. A communique ring transmits sound only while worn, and a wearer can remove the ring if she needs to be silent. Only magical ", " or distance will block this communication, and wearers can speak through walls and other obstructions normally. The rings pick up only sound directly spoken into them by the wearer with the intent to transmit, not ambient sounds or the voices of other creatures.", "CONSTRUCTION REQUIREMENTS", " 3,000 gp; ", " ", "; ", " ", " © 2016, Paizo Inc.; Authors: Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."]},
{"name": "Holdout Ring", "info": [" 11,000 gp; ", " ring; ", " 9th; ", " —; ", " moderate ", "DESCRIPTION", "Made of aged bronze and steel, this ring looks like it should have a gem set in it, but instead has an empty circular hole. The hole in the ring holds a single ", " bullet; if one is placed inside (as a ", "), it merges seamlessly into the ring. While a bullet is merged into the ring, the wielder can fire the bullet as though she were using a +1 ", " that can’t misfire. Once the bullet has been fired from the ring, a new bullet can’t be placed inside for 24 hours.", "Each holdout ring is created with two +1 ammunition special abilities and one +2 ammunition special ability. If the wearer has the ", " class feature, she can expend grit (maximum 4 grit points) to imbue bullets merged with the gun with one or more of these abilities. Imbuing a bullet with a +1 special ability costs 1 grit point; imbuing one with a +2 special ability costs 2 grit points. Each ring’s special abilities are established upon the item’s creation and can’t be changed. If a special ability has multiple versions, as does ", ", the specific version must be set at that time (e.g., ", " ", "). A typical holdout ring has the ", ", ", ", and ", " special abilities.", "CONSTRUCTION REQUIREMENTS", " 5,500 gp; ", " ", ", ", ", ", "; ", " creator must meet the requirements for the ammunition special abilities that can be imbued by the ring"]},
{"name": "Ironbound Ring", "info": [" varies: Master’s ironbound ring 8,000 gp, Minion’s ironbound ring 500 gp; ", " ring; ", " 5th ", " -; ", " faint ", " and ", "DESCRIPTION", "While holding one or more minion’s ironbound rings, the wearer of a master’s ironbound ring can impart instructions of 50 words or fewer to each minion’s ironbound ring.", "The wearer of a minion’s ironbound ring can recall the instructions at will and is aware of any action that would cause him to act against those instructions. The DC of any skill check attempted to force the wearer to abandon, misinterpret, or consciously fail the instructions increases by 5, such as for ", " checks to trick the wearer or ", " checks to interrogate him. The wearer gains a +3 ", " on ", " saves to resist spells and effects that would force him to act against the instructions, such as ", " and ", ".", "CONSTRUCTION REQUIREMENTS", " varies: Master’s ironbound ring 4,000 gp, Minion’s ironbound ring 250 gp; ", " ", "; ", " ", ", ", " © 2017, Paizo Inc.; Authors: Benjamin Bruck, John Compton, Crystal Frasier, Tim Hitchcock, Jenny Jarzabski, Isabelle Lee, Joe Pasini, Jessica Price, David Schwartz, and Josh Vogt."]},
{"name": "Decoy Ring", "info": [" moderate ", "; ", " 11th; ", " ring; ", " 12,000 gp; ", " —", "DESCRIPTION", "This ring is a thick loop of mirrorlike metal.", "Whenever the wearer of this ring takes the ", " or becomes ", " (including falling ", "), it instantly makes her ", " for 3 rounds and creates four illusory duplicates that either run off in opposite directions or perform other plausible actions that could draw enemy attention away from her. The duplicates last for 3 rounds before disappearing, but they instantly pop out of existence if struck by an attack (AC 10) and can be disbelieved (", " DC 19). Allies of the wearer always know her true location and can freely provide aid or assistance to her.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 6,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Kyton Ring", "info": [" 1,000 gp; ", " ring; ", " 7th; ", " — ", " moderate ", "DESCRIPTION", "This rusty iron ring looks like a twisted chain.", "On command, the ring can produce a rusty, clanky length of iron chain (", " 10, 5 hp, break DC 26). The ring can create no more than 100 feet of chain in this way. This total length can be split among many uses, but must be spent in 10-foot increments. When the ring’s daily allotment of chain is renewed, any previously conjured chain rusts away.", "Once per day as a ", ", the user can shoot a chain from the ring as though it were a ", ", except the range increment is 50 feet. Whatever length of chain she shoots out counts against ring’s daily allotment.", "CONSTRUCTION REQUIREMENTS", " 500 gp; ", " ", "; ", " ", " © 2016, Paizo Inc.; Authors: John Bennett, Clinton J. Boomer, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Jim Groves, Steven Helt, Thurston Hillman, Eric Hindley, Brandon Hodge, Mikko Kallio, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Alistair Rigg, Alex Riggs, David N. Ross, F. Wesley Schneider, David Schwartz, Mark Seifter, and Linda Zayas-Palmer."]},
{"name": "Ring of Adept Maneuvers", "info": [" 15,000 gp; ", " ring; ", " 5th; ", " —; ", " faint ", "DESCRIPTION", "This variant ring of ki mastery is made of a lock of hair held together by small bands to form a ring.", "The ring allows a wearer with a ", " to store up to 2 ki points in the ring as a ", ". These points remain in the ring until used. The wearer can use the ki points normally, but gains the following benefits when ki points are stored in the ring.", "As long as at least 1 ki point is stored in the ring, the wearer gains a +2 bonus on ", " checks to ", ", ", ", or ", " opponents.", "If at least 2 ", " points are stored in the ring, the wearer takes only a –1 penalty on ", " when making a ", " instead of a –2 penalty.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " the creator must have the ", " class feature; ", " 7,500 gp"]},
{"name": "Ring of Ancestral Blood Magic", "info": [" 4,000 gp; ", " ring; ", " 10th; ", " —; ", " moderate ", "DESCRIPTION", "While the wearer is bloodraging, he can cast a bonus spell gained from his bloodrager ", " without expending a spell slot. He can do this three times per day, and must expend a number of rounds of bloodrage equal to the level of the spell to be cast. The wearer must meet all the other requirements for spellcasting.", "CONSTRUCTION REQUIREMENTS", " 2,000 gp; ", " ", ", ", ", ", "; ", " creator must have the bloodrage class feature", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Dungeon Ring", "info": [" moderate ", "; ", " 8th; ", " ring; ", " 16,000 gp (", "), 250 gp (", "); ", " —", "DESCRIPTION", "A ", " ", " is worked gold, set with carnelians. The ring is magically attuned to one or more iron ", ". When the wearer of a ", " places a ", " on a subject, the prisoner cannot remove the ring without the use of a ", ", ", ", ", ", or ", " spell. The wearer of the ", " can also remove a linked ", " at any time.", "The jailer is aware of any wearer of a linked ", " like a constant ", " spell. Additionally, all wearers of linked ", " count as familiar to the jailer for purposes of spells such as ", " and ", ".", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 8,000 gp (", "), 125 gp (", ")", "Pathfinder Roleplaying Game: Ultimate Equipment (OGL) © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Animal Friendship", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 10,800 gp; ", " —", "DESCRIPTION", "A ", " always bears some sort of animal-like design in its craftsmanship. On command, this ring affects an ", " as if the wearer had cast ", ", causing the animal to regard the wearer as a trusted friend.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 5,400 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Arcane Signets", "info": [" faint universal; ", " 8th; ", " ring; ", " 1,000 gp; ", " —", "DESCRIPTION", "The approximately 1-inch-diameter pentagon of emerald green crystal that dominates this otherwise plain silver ring forms itself into a specific rune, sigil, or similar identifying marker each time a person first puts it on. If the wearer expects this to occur, she can cause the crystal to adopt any shape she wishes. If the wearer does not expect this to occur, the crystal instead molds itself into an image that symbolizes the wearer or some dominant facet of her personality. Once the crystal assumes this initial form, it always takes that form whenever the same wearer puts on the ring. The wearer can, as a ", ", embed this image on any object (as if using ", ") simply by pressing the ring against it. The wearer may choose the color and other cosmetic features of the image each time she uses the ring. The brand is otherwise permanent unless removed by ", ", ", ", or a more powerful spell.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 500 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Arcane Mastery", "info": [" strong ", " and ", "; ", " 11th; ", " ring; ", " 20,000 gp; ", " —", "DESCRIPTION", "This ring is a thin but sturdy piece of forged steel crafted to resemble a serpent swallowing its tail, and is magically imbued to reveal the secrets of arcane mastery to its wearer. The ring allows a wearer with an ", " to store up to 4 points from his arcane pool in the ring as a ", ". These points remain in the ring until used. A wearer can spend arcane pool points stored in the ring as if they were his own, or can spend them in each of the following ways.", "As a ", ", the wearer can expend 1 arcane pool point stored in the ring to gain a +2 bonus on ", " checks for 1 round. ", "As a ", ", the wearer can expend 1 arcane pool point stored in the ring to use the ", " magus arcana using his own ", " level to determine the effect. ", "As an ", ", the wearer can expend up to 4 arcane pool points stored in the ring to use the ", " magus arcana.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 10,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Austere Majesty", "info": [" 3,000 gp; ", " ring; ", " 5th ", " —; ", " faint ", "APPEARANCE", "A dozen tiny gemstones line the outer edges of this golden ring.", "EFFECTS", "As long as one or more creatures can see it, the ring grants its wearer a +2 ", " on ", " and ", " checks to influence those creatures. In addition, the wearer can allow a willing creature to inspect the ring as a ", ". If she does, for the following 3 rounds the creature and the wearer can speak while the ring’s power obfuscates the details of the conversation. To every other creature able to hear the creature and the wearer’s words during this time, the conversation sounds like a continued back-and-forth exchange of exaltations about the ring’s artistry.", "CONSTRUCTION REQUIREMENTS", " 1,500 gp; ", " ", "; ", " ", ", ", " © 2018, Paizo Inc.; Authors: John Compton, Eleanor Ferron, Thurston Hillman, Nathan King, Isabelle Lee, Jacob W. Michaels, Adrian Ng, David N. Ross, and Mike Welham."]},
{"name": "Ring of Balanced Grip", "info": [" 1,600 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "This sturdy ring allows the user to ignore the nonproficiency penalty for using a particular type of improvised weapon, such as a crowbar or pitchfork, and grants a +1 ", " on ", " with that item as though it were a masterwork weapon.", "CONSTRUCTION REQUIREMENTS", " 800 gp; ", " ", "; ", " ", " © 2017, Paizo Inc.; Authors: Jenny Jarzabski, Mikko Kallio, Isabelle Lee, Luis Loza, Joe Pasini, David N. Ross, and Linda Zayas-Palmer."]},
{"name": "Ring of Blinking", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 27,000 gp; ", " —", "DESCRIPTION", "On command, this ring makes the wearer blink, as the ", " spell.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 13,500 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Chameleon Power", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 12,700 gp; ", " —", "DESCRIPTION", "As a ", ", the wearer of this ring can gain the ability to magically blend in with the surroundings. This provides a +10 ", " on her ", " checks. As a ", ", she can also use the spell ", " as often as she wants.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 6,350 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Climbing", "info": [" faint ", "; ", " 5th; ", " ring; ", " 2,500 gp; ", " —", "DESCRIPTION", "This magic ring has the deceptively simple appearance of a plain leather cord that wraps securely around a finger. The ring continually grants the wearer a +5 ", " on ", " checks.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have 5 ranks in the ", " skill; ", " 1,250 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Climbing, Improved", "info": [" faint ", "; ", " 5th; ", " ring; ", " 10,000 gp; ", " —", "DESCRIPTION", "This ring functions as a ", ", except it grants a +10 ", " on its wearer’s ", " checks.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have 10 ranks in the ", " skill; ", " 5,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Continuation", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 56,000 gp; ", " —", "DESCRIPTION", "Whenever the wearer of the ring casts a spell with a range of personal and a duration of 10 minutes per level or greater that spell remains in effect for 24 hours or until the wearer casts another spell with a range of personal (whichever comes first). Spells that usually only affect one specific action (such as making a particular attack) are expended after that action. This does not reduce the duration of spells that normally last longer than 24 hours. Casting a new spell does not eliminate a previous spell if its normal duration is such that it would still be in effect. However, attempts to dispel or otherwise eliminate a spell kept active by the ring work normally and, if successful, remove the spell from the ring, causing the wearer to lose all benefits from that spell.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 28,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Counterspells", "info": [" moderate ", "; ", " 11th; ", " ring; ", " 4,000 gp; ", " —", "DESCRIPTION", "Upon first examination, this ring seems to be a ", ". However, while it allows a single spell of 1st through 6th level to be cast into it, that spell cannot be cast out of the ring again. Instead, should that spell ever be cast upon the wearer, the spell is immediately countered, as a ", ", requiring no action (or even knowledge) on the wearer’s part. Once so used, the spell cast within the ring is gone. A new spell (or the same one as before) may be placed into it again.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 2,000 gp.", "The ring only affects spells that target you, not spells that include you in the area. One possible interpretation is that the ring would make you immune to that casting of the spell (and the rest of the area would be affected normally), but that would require additional explanatory language and create strange situations where you’d be immune to ", " or ", " and able to wander freely through such effects. Instead, it is clearer to adjudicate if the ring only affects spells targeting you.", "[", "]", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Craft Magic", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 12,000 gp; ", " —", "DESCRIPTION", "A ", "always bears some sort of tool-like design in its craftsmanship. The wearer of the ring sees spells as similar to crafts, and vice versa. The wearer may make a ", " check in place of a ", " check to identify an item that could be created with that ", " skill. The wearer may also expend a spell slot or prepared spell to gain an ", " equal to the level of the expended spell on a single ", " or ", " check (regardless of the amount of time needed to make the check).", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have the ", " racial trait; ", " 6,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Culturemeld", "info": [" 7,800 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "This ornately carved ", " ring is sometimes gifted to ", " leaving their elven communities so as to ease transition into ", " culture.", "A ", " slightly alters the wearer’s words to be more appropriate to the listener’s culture and expectations, granting the wearer a +5 ", " on language-based ", " checks.", "If worn by a ", ", a ", " grants the wearer the ability to speak and understand an additional language dependent on the local area. If the wearer spends 1 day in a settlement the size of a village or larger, the ring becomes attuned to any dominant language spoken there other than Common. After the ring is attuned, the wearer gains that language as a bonus language (if she didn’t already know it), though she can only speak and understand it. After 4 more days of attunement, the wearer gains the ability to read the language as well, though not the ability to write that language, and gains a +5 ", " on opposed ", " checks against speakers of the attuned language.", "These benefits expire once the wearer has been out of contact with people who speak the attuned language for longer than 1 day or when the ring becomes attuned to a new language.", "CONSTRUCTION REQUIREMENTS", " 3,900 gp; ", " ", "; ", " ", " © 2014, Paizo Publishing, LLC; Authors: Judy Bauer, Neal Litherland, Ryan Macklin, and David N. Ross."]},
{"name": "Ring of Curing", "info": [" moderate ", "; ", " 8th; ", " ring; ", " 10,000 gp; ", " —", "DESCRIPTION", "This simple copper ring is a boon to those who spend their lives healing others.", "Whenever the wearer of a ring of curing casts a ", " spell of the ", " subschool, all maximums to the level-dependent healing provided by that spell increase by 2. For example, ", " would provide a maximum ", " of 1d8 + 7 (at 7th ", "), while ", " would cure a maximum of 170 points of damage. This ring does not increase the wearer’s actual ", ", nor the amount of level-dependent healing provided by any such spell.", "CONSTRUCTION REQUIREMENTS", " ", ", ", "; ", " ", "; ", " 5,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Delayed Doom", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 45,000 gp; ", " —", "DESCRIPTION", "Whenever the mind or body of this ring’s wearer first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an ", ", choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the ring’s nine garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls ", ", when the ring is removed, or 1 minute after the last time the ring’s power activated; rounds spent delaying the effect do not count toward the effect’s duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed. The price of the ring is reduced by 5,000 gp for each of its garnets that has been destroyed.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 22,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Djinni Calling", "info": [" strong ", "; ", " 17th; ", " ring; ", " 125,000 gp; ", " —", "DESCRIPTION", "This “genie” ring serves as a special gate by means of which a specific ", " can be called from the ", ". When the ring is rubbed (a ", "), the call goes out, and the djinni appears on the next round. The djinni faithfully obeys and serves the wearer of the ring, but never for more than 1 hour per day. If the djinni of the ring is ever killed, the ring becomes non-magical and worthless.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 62,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Ectoplasmic Invigoration", "info": [" moderate ", "; ", " 6th; ", " ring; ", " 12,000 gp; ", " —", "DESCRIPTION", "A ", " wearing a ring of ectoplasmic invigoration can use his ", " class feature to absorb his ", " (dismissing it in the process) instead of bringing it to his side. He gains 2 ", " per ", " of the ", " and the benefits of a ", " spell. The eidolon must still be within range of his maker’s call ability. Any temporary hit points gained fade after 1 hour or when the eidolon is summoned again. A wearer with the ", " ability can transport himself to the eidolon’s square (still absorbing and dismissing it) rather than calling the eidolon to him.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " the creator must be able to summon an ", " and have the ", " class feature; ", " 6,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Elemental Command", "info": [" strong ", "; ", " 15th; ", " ring; ", " 200,000 gp; ", " —", "DESCRIPTION", "All four kinds of ", " are very powerful. Each appears to be nothing more than a lesser magic ring until fully activated (by meeting a special condition, such as single-handedly slaying an ", " of the appropriate type or exposure to a sacred material of the appropriate element), but each has certain other powers as well as the following common properties.", "Elementals of the plane to which the ring is attuned can’t attack the wearer, or even approach within 5 feet of him. If the wearer desires, he may forego this protection and instead attempt to charm the elemental (as ", " ", " DC 17 negates). If the charm attempt fails, however, absolute protection is lost and no further attempt at charming can be made.", "Creatures from the plane to which the ring is attuned who attack the wearer take a –1 penalty on their ", ". The ring wearer makes applicable ", " against the ", " creature’s attacks with a +2 ", ". He gains a +4 ", " on all ", " against such creatures. Any weapon he uses bypasses the ", " of such creatures, regardless of any qualities the weapon may or may not have.", "The wearer of the ring is able to converse with creatures from the plane to which his ring is attuned. These creatures recognize that he wears the ring, and show a healthy respect for the wearer if alignments are similar. If alignments are opposed, creatures fear the wearer if he is strong. If he is weak, they hate and desire to slay him.", "The possessor of a ", " takes a ", " penalty as follows:", "In addition to the powers described above, each specific ring gives its wearer the following abilities according to its kind.", "The ring appears to be a ", " until a certain condition is met to ", " its full potential. It must be reactivated each time a new wearer acquires it.", "The ring appears to be a ", " (allowing the wearer to cast ", " at will) until the established condition is met.", "The ring appears to be a ", " until the established condition is met.", "The ring appears to be a ", " until the established condition is met.", "CONSTRUCTION REQUIREMENTS", " ", ", ", ", all appropriate spells; ", " 100,000 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Eloquence", "info": [" 3,500 gp; ", " ring; ", " 3rd; ", " —; ", " faint divination", "DESCRIPTION", "Fine etchings spell out the alphabets of four languages around the inside of this finely crafted silver band. The wearer gains the ability to speak and understand the four languages whose alphabets are inscribed on the ring. Normally the languages are Common, Dwarven, Elven, and Gnome. Less often, such rings are attuned to Giant, Goblin, Orc, and Undercommon, and rings with different sets of languages might also exist. The wearer retains the ability to speak in these languages even if she assumes a form normally unable to do so (such as a ", " wild shaped into a ", ").", "The ring also makes it easier for the wearer to find the correct words to express herself, granting a +2 ", " on ", ", ", ", ", ", and ", " (oratory) checks. Also, if the wearer is ", " and attempts to cast a spell with a verbal component, the chance of spell failure is reduced to 10%.", "CONSTRUCTION REQUIREMENTS", " 1,750 gp; ", " ", "; ", " ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Energy Resistance", "info": [" moderate ", "; ", " 11th; ", " ring; ", " 12,000 gp (minor), 28,000 gp (major), 44,000 gp (greater); ", " —", "DESCRIPTION", "Rings of this type come in a wide variety of designs and colorations, typically related to the types of energy they defend against. These rings continually protect their wearers from damage from one type of energy—acid, cold, electricity, fire, or sonic (chosen by the creator of the item; determine randomly if found as part of a treasure hoard). Each time the wearer would normally take such damage, subtract the ring’s ", " value from the damage dealt.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 6,000 gp (minor), 14,000 gp (major), 22,000 gp (greater).", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Energy Shroud", "info": [" strong ", "; ", " 13; ", " ring; ", " 19,500 gp; ", " — ", "DESCRIPTION", "A ", " always appears to be glass or crystal in construction, tinted in a red, green, blue, or yellow hue. Closer inspection reveals a small band of metal within the glass or crystal. Treasured by frontline fighters and anyone with a trusted ", " ally, rings of energy shroud normally function as a minor ", ". However, once per day as an ", ", the ring’s wearer can negate the damage of an incoming acid, cold, electricity, or fire energy effect for himself (but not for other creatures affected by the spell or effect), transforming that damage into a shroud of energy that wreathes the wearer’s body acting as if under the effects of the ", " spell. The elemental aura effect has the same energy type of the damage negated.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 9,750 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Entropy and Order", "info": [" 16,200 gp; ", " ring; ", " 10th; ", " —; ", " moderate ", "DESCRIPTION", "This gold ring resembles tiny ", " wings folded around a clear crystal. Once per day, the wearer can target herself with a ", " or ", " effect that lasts for 10 minutes. However, if the wearer uses the ring of entropy and order to gain ", " while on a plane with the mildly chaos-aligned or strongly chaos-aligned trait, or to gain ", " while on a plane with the mildly law-aligned or strongly law-aligned trait, the effect instead lasts for 1 hour. If the wearer fails a saving throw against a ", " or ", " effect while on a plane with the mildly chaos-aligned, mildly law-aligned, strongly chaos-aligned, or strongly law-aligned traits, she can ", " the effect as an ", ".", "CONSTRUCTION REQUIREMENTS", " 8,100 gp; ", "; ", " ", ", ", ", ", " © 2018, Paizo Inc.; Authors: Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."]},
{"name": "Ring of Evasion", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 25,000 gp; ", " —", "DESCRIPTION", "This ring continually grants the wearer the ability to avoid damage as if she had ", ". Whenever she makes a ", " ", " to determine whether she takes half damage, a successful save results in no damage.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 12,500 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Far Strike", "info": [" 6,000 gp; ", " ring; ", " 8th; ", " —; ", " moderate ", "DESCRIPTION", "This unassuming black ring changes color to a silver pearlescent sheen when held near a fire.", "Once per day as a ", ", the wearer can make a melee weapon attack or ", " attack against any opponent within 30 feet. The wearer must be otherwise capable of performing the attack to use this ability.", "CONSTRUCTION REQUIREMENTS", " 3,000 gp; ", " ", "; ", " ", ", ", " © 2014, Paizo Inc.; Authors: David N. Ross, David Schwartz, and Kaitlyn Sprague."]},
{"name": "Ring of Fear Reflection", "info": [" 48,000 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", " and ", "DESCRIPTION", "This simple silver ring has a fear rune etched into its hammered apex.", "The ring provides a ", " versus fear effects. This bonus starts at +0 and can advance no higher than +5.", "Every time the wearer succeeds at a ", " save versus a ", " affect, the ring’s bonus increases by +1. Should the wearer fail a ", " save versus ", ", the ring’s bonus immediately falls to +0.", "If the bonus is +5 and the wearer is affected by a ", " effect and succeeds at her ", " save, the ring automatically reflects the ", " effect back to its source. If the source is a creature not immune to ", ", it must succeed at a ", " save at the DC made by the ring’s wearer or be affected by the ", " effect. Only the source of an area ", " effect is targeted by such a reflected spell.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", "; ", " 24,000 gp", " © 2013, Paizo Publishing, LLC; Authors: Shaun Hocking, Marie Small, and Jerome Virnich."]},
{"name": "Ring of Feather Falling", "info": [" faint ", "; ", " 1st; ", " ring; ", " 2,200 gp; ", " —", "DESCRIPTION", "This ring is crafted with a feather pattern all around its edge. It acts exactly like a ", " spell, activated immediately if the wearer falls more than 5 feet.", "CONSTRUCTION REQUIREMENTS", ", ", "; ", " 1,100 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Ferocious Action", "info": [" faint ", "; ", " 5th; ", " ring; ", " 3,000 gp; ", " —", "DESCRIPTION", "This ring allows its wearer to persevere through physical or mental trauma that hampers his actions.", "Once per day, when the wearer gains the ", " condition from an enemy’s attack, she can ignore that condition for up to 5 rounds. This does not prevent her from gaining the ", " condition again, and it doesn’t protect her if she gained the ", " condition multiple times.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 1,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Foe Focus", "info": [" faint ", "; ", " 5th; ", " ring; ", " 10,000 gp; ", " — ", "DESCRIPTION", "This ring of jagged steel gives the impression that it was salvaged from a suit of armor and then crudely bent into a circle.", "The wearer of the ring can, at will, designate any one opponent she can see as a particularly dangerous foe. She gains a +2 bonus to her ", " and ", " against attacks made by that opponent until she designates a new enemy.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 5,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Force Shield", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 8,500 gp; ", " — ", "DESCRIPTION", "This ring generates a shield-sized (and shield-shaped) ", " that stays with the ring and can be wielded by the wearer as if it were a ", " (+2 AC). This special creation has no ", " or ", " since it is weightless and encumbrance-free. It can be activated and deactivated at will as a ", ".", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 4,250 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Forcefangs", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 8,000 gp; ", " — ", "DESCRIPTION", "This band negates any force spell or force ", " targeted at the wearer. Doing so gives the ring a number of charges equal to the spell level of the incoming force effect. The ring can hold a maximum of 9 charges. ", "If an incoming force attack would charge the ring beyond this limit, the ring does not negate the attack or gain charges, and the attack affects the wearer normally. On command, the wearer can use the ring’s charges to cast ", ", unleashing one missile (1d4+1 force damage) per charge but no more than five missiles per round.", "CONSTRUCTION REQUIREMENTS", " ", ", ", ", ", "; ", " 4,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Freedom of Movement", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 40,000 gp; ", " —", "DESCRIPTION", "This gold ring allows the wearer to act as if continually under the effect of a ", " spell.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 20,000 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Friend Shield", "info": [" moderate ", "; ", " 10th; ", " ring; ", " 50,000 gp; ", " — ", "DESCRIPTION", "These curious rings always come in pairs. A ", " without its mate is useless. Either wearer of one of a pair of the rings can, at any time, command his ring to cast a ", " spell with the wearer of the mated ring as the recipient. This effect has no range limitation. ", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 25,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Grit Mastery", "info": [" faint ", " and ", "; ", " 3rd; ", " ring; ", " 6,840 gp; ", " — ", "DESCRIPTION", "This ring is made out of fused firearm bullets, making it a chunky but overall impressive ring. Twice per day, as a ", ", when the wearer regains ", ", she can choose to store it in the ", " instead of regaining the grit point. She can store up to 2 grit points within the ring in this way. She can spend the grit points stored in the ring either of the following ways. ", "Once per day, without the need to take an action to do so, the wearer can spend 1 grit point stored in the ring to grant herself a +2 ", " to ", ".", "Once per day, as a ", ", the wearer of the ring can spend 2 grit points stored within the ring to activate a ", " as the spell. ", "Any grit points stored in the ring disappear at the start of each day.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " creator must have the grit class feature; ", " 3,420 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Heroes", "info": [" moderate (no school); ", " 7th; ", " ring; ", " 8,000 gp; ", " —", "DESCRIPTION", "Sculpted in the shape of two noble looking bronze lions charging toward a centrally placed garnet, this ring grants the wearer the ", " feat. The ring must be worn for 24 hours before it takes effect. The wearer can also call upon the ring’s power to gain a ", " that must be used immediately, although this causes the ring to lose its powers permanently.", ": See ", " for full details.", "CONSTRUCTION REQUIREMENTS", " ", ", ", "; ", " 4,000 gp", ". Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."]},
{"name": "Ring of Immolation", "info": [" moderate ", " (fire) ", " 10th; ", " ring; ", " 12,000 gp; ", " —", "DESCRIPTION", "A ", " is made of pumice and hardened ash but is as strong as metal. As a ", ", the wearer can activate the ring to create a ", " (warm) on himself. The wearer of a ", " can activate a ", " on himself for up to 10 rounds each day (these rounds need not be used consecutively). If the wearer would take magical cold damage and any rounds of duration remain, the ring automatically activates for 1 round and protects the wearer from the cold damage as per ", ".", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 6,000 gp", "Pathfinder 11: Skeletons of Scarwall. Copyright 2008, Paizo Publishing LLC. Author: Greg A. Vaughan"]},
{"name": "Ring of Inner Fortitude", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 18,000 gp (minor), 42,000 gp (major), 66,000 gp (greater); ", " —", "DESCRIPTION", "Alternating diamonds and rubies stud this band of white gold.", "Wearing a ", " does not make the wearer immune to conditions such as ", " or ", " even if the wearer ignores all ", ", ", ", or penalties from the condition.", "If the ring prevents any damage, drain, or penalties that are associated with a beneficial effect, it also negates the beneficial effect.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 9,000 gp (minor), 21,000 gp (major), 33,000 gp (greater).", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Invisibility", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 20,000 gp; ", " —", "DESCRIPTION", "By activating this simple silver ring, the wearer can benefit from ", ", as the spell.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 10,000 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Jumping", "info": [" faint ", "; ", " 2th; ", " ring; ", " 2,500 gp; ", " —", "DESCRIPTION", "This ring continually allows the wearer to leap about, providing a +5 ", " on all his ", " checks made to make high or long jumps.", "CONSTRUCTION REQUIREMENTS", "; ", " creator must have 5 ranks in the ", " skill; ", " 1,250 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Jumping, Improved", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 10,000 gp; ", " — ", "DESCRIPTION", "This ring functions as a ", ", except it grants the wearer a +10 ", " all her ", " checks made to make high or long jumps.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have 10 ranks in ", "; ", " 5,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Ki Mastery", "info": [" faint ", "; ", " 5th; ", " ring; ", " 10,000 gp; ", " — ", "DESCRIPTION", "This ring is half onyx and half clear-white crystal, magically fused together and hardened to the strength of steel. It allows a wearer with a ", " to store up to 2 ki points in the ring as a ", ". These points remain in the ring until used. The wearer can use the ", " points normally, or can gain the following benefits when he has ", " points stored in the ring. ", "As long as there is at least one ", " point stored in the ring, the wearer gains a +2 bonus to ", " against ", ", ", ", and ", " attempts. ", "As long as there are at least 2 ", " points stored in the ring, the wearer reduces the number of ", " points needed to use a ", " or ", " ability by 1 (minimum 1 ", " point).", "CONSTRUCTION REQUIREMENTS", ", ", "; ", " creator must be able to use ", "; ", " 3,420 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Lingering Blood Magic", "info": [" 2,000 gp; ", " ring; ", " 11th; ", " —; ", " moderate ", "DESCRIPTION", "When the wearer of this ring is bloodraging, he can expend 1 round of bloodrage to extend the duration of a beneficial spell affecting him with a duration of 1 round per level or greater by 2 rounds. This is a ", " the wearer can take once per round.", "CONSTRUCTION REQUIREMENTS", " 1,000 gp; ", " ", ", ", ", ", "; ", " creator must have the bloodrage class feature", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Maniacal Devices", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 5,000 gp; ", " — ", "DESCRIPTION", "This elaborately decorated ring is crafted with the design of a fierce dragon wrapped greedily around a shining gemstone. It grants the wearer a +5 ", " on all ", " (traps) and ", " checks. Even if he has no ranks in these skills, the wearer may make Craft (traps) and Disable Device checks as if he were trained in them.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " creator must have 5 ranks in the relevant skill; ", " 2,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Natural Attunement (Kami)", "info": [" 7,800 gp; ", " ring; ", " 5th; ", " —; ", " faint ", "DESCRIPTION", "This is ring carved from a single piece of cherry wood. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters he can ", " with those spells, adds ", " to the 5th-level list, adds ", " to the 7th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,900 gp; ", " ", "; ", " ", ", ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Natural Attunement (Drake)", "info": [" 12,880 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "This coiling band is made of jade carved into the shape of a ", ". If the wearer can cast ", " spells, the wearer adds ", " and ", " to the 4th-level list of monsters he can ", " with those spells, adds ", " to the 5th-level list, adds ", " to the 6th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 6,440 gp; ", " ", "; ", " ", ", ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Mind Shielding", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 8,000 gp; ", " —", "DESCRIPTION", "This ring is usually of fine workmanship and wrought from heavy gold.", "The wearer is continually immune to ", ", ", ", and any attempt to magically discern her ", ".", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 4,000 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Natural Attunement (Leshy)", "info": [" 2,800 gp; ", " ring; ", " 3rd; ", " —; ", " faint ", "DESCRIPTION", "This ring is made of thin but strong vines braided together in an elegant weave. If the wearer can cast ", " spells, the wearer adds leaf ", " to the 1st-level list of monsters he can ", " with those spells, adds gourd ", " to the 2nd-level list, adds ", " the 3rd-level list, and adds seaweed ", " to the 4th-level list. Also, once per day on command the wearer can use this ring to ", " a leaf ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 1,400 gp; ", " ", "; ", " ", ", ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Plagues", "info": [" 20,000 gp; ", " ring; ", " 11th; ", " —; ", " moderate ", "DESCRIPTION", "This silver ring is set with a black opal. Once per day, when the wearer is reduced to half or fewer of her maximum hit point total, whoever dealt the activating blow to the wearer is immediately subjected to a major curse with unlimited range. A successful DC 19 ", " saving throw is needed to negate the spell. Rather than one of the listed curse effects, the curse imposes a –4 penalty on the victim’s saving throws and causes the victim to contract a ", " chosen by the wearer from the contagion list without a save. The cursed ", " has no onset time, but the attacker is allowed the normal saving throw to avoid its effects. It can be cured only by successfully casting both ", " and ", " within 1 minute of each other. Those exposed to the cursed attacker thereafter must save against the mundane version of the ", " or become infected (though they are not cursed).", "Once per day, if the wearer is killed or reduced to negative ", ", a plague of curses is unleashed. The attacker and the attacker’s five nearest allies or immediate blood relatives become the targets of the curse described above. If the wearer is restored to at least 1 hit point, these curses end, allowing surviving victims to recover naturally.", "CONSTRUCTION REQUIREMENTS", " 10,000 gp; ", " ", "; ", " ", ", ", ", ", " © 2014, Paizo Inc.; Authors: Paris Crenshaw, Jim Groves, Sean McGowen, and Philip Minchin."]},
{"name": "Ring of Planar Focus", "info": [" 4,000 gp; ", " ring; ", " 15th; ", " —; ", " strong ", "DESCRIPTION", "This large silver ring has a massive setting for a cloudy white crystal about an inch in diameter.", "Once per week as a ", ", the wearer can tap the ring with a forked rod attuned to a specific plane (the focus for a ", " spell). When tapped, the crystal transforms into a rough topographical ", " of the plane in question for 1 minute. The wearer can manipulate the crystal to focus on a single specific location within the plane, although the topographical elements remain rough and display only large or well-known features around the desired location. If the wearer has been to that location personally, she can focus the crystal on the location in 1 full round. Otherwise, she can attempt a DC 15 ", " (planes) check to focus on a location of her choice as a ", ". This location must be a public or well-known area, such as a public plaza in the Common Quarter in the City of Brass. Obscure locations or locations controlled by a divinity cannot be focused on—in all cases, the GM has final say on whether a region can be focused upon.", "If the wearer casts ", " to travel to the focused location while the ", " is active, she arrives without error at the site, rather than 5d% miles away. Once a ring of planar focus is used to aid a casting of ", ", it becomes inactive for 24 hours.", "CONSTRUCTION REQUIREMENTS", " 2,000 gp; ", "; ", " ", " © 2018, Paizo Inc.; Authors: Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."]},
{"name": "Ring of Powerful Blood Magic", "info": [" 3,000 gp; ", " ring; ", " 9th; ", " —; ", " moderate ", "DESCRIPTION", "When the wearer of this ring is bloodraging and casts a spell, as a ", " he can increase the save DC of the spell by 1. The wearer can do this a maximum of three times per day. This has no effect on spells that do not require saving throws.", "CONSTRUCTION REQUIREMENTS", " 1,500 gp; ", " ", "; ", " ", " creator must have the bloodrage class feature", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Protected Life", "info": [" 9,000 gp; ", " ring; ", " 7th; ", " 1 lb.; ", " moderate ", "DESCRIPTION", "This silver ring features arboreal motifs, and is set with a small but brilliant sapphire.", "If the wearer has the ", " class feature, the radius of his channeled energy increases by 5 feet. Additionally, when the wearer channels energy, he may choose to exempt one creature from the effects of his channeling. If the wearer has the ", " feat, the ring of protected life increases the number of creatures he may normally exempt by one. Finally, once per day the wearer may ", " as a ", " that does not provoke ", "; doing so renders the ring of protected life inert for 24 hours, during which time it does not confer any benefits.", "CONSTRUCTION REQUIREMENTS", " ", ", ", "; ", " creator must have the ", " class feature; ", " 4,500 gp", " © 2014, Paizo Publishing, LLC; Authors: Dennis Baker, Jay Loomis, Alex Putnam, Adam Roy, Tork Shaw, and Larry Wilhelm."]},
{"name": "Ring of Protection", "info": [" faint ", "; ", " 5th; ", " ring; ", " 2,000 gp (+1), 8,000 gp (+2), 18,000 gp (+3), 32,000 gp (+4), 50,000 gp (+5); ", " —", "DESCRIPTION", "This ring offers continual magical protection in the form of a ", " bonus of +1 to +5 to ", ".", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " creator must be of a level at least three times the bonus of the ring; ", " 1,000 gp (+1), 4,000 gp (+2), 9,000 gp (+3), 16,000 gp (+4), 25,000 gp (+5)", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Rat Fangs", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 5,000 gp; ", " —", "DESCRIPTION", "This bone ring is the shape of an elongated ", " biting its own tail. The wearer gains a bite attack as a primary ", ". This attack deals 1d4 points of piercing damage for a Medium wearer or 1d3 points of damage for a Small wearer. After about a week of wearing the ring, the wearer’s appearance becomes more ratlike, though she still looks like a member of her original race (for example, a ", " might gain prominent teeth).", "CONSTRUCTION REQUIREMENTS", " ", ", ", ", ", "; ", " 2,500 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Jason Bulmahn, Adam Daigle, Jim Groves, Tim Hitchcock, Hal MacLean, Jason Nelson, Stephen Radney-MacFarland, Owen K.C. Stephens, Todd Stewart, and Russ Taylor."]},
{"name": "Ring of Refusal", "info": [" 32,500 gp; ", " ring; ", " 13th; ", " —; ", " strong ", " and ", "DESCRIPTION", "Powerful gillmen who suspect they harbor unwitting allegiance to hidden masters use rings of refusal to resist such bonds.", "The wearer of a ring of refusal gains a +2 bonus on saving throws against ", " spells and effects. When the wearer is targeted by ", " or a similar effect that ends an ", ", the caster gains a +2 bonus on ", " checks to resolve the effect.", "The wearer can also ", " the ring once per day as an ", " to gain ", " 25 against a single ", " spell or effect.", "CONSTRUCTION REQUIREMENTS", " 16,250 gp; ", " ", "; ", " ", ", ", "© 2015, Paizo Inc.; Authors: John Compton, Paris Crenshaw, Mike Myler, Tork Shaw, and Larry Wilhelm."]},
{"name": "Ring of Regeneration", "info": [" strong ", "; ", " 15th; ", " ring; ", " 90,000 gp; ", " —", "DESCRIPTION", "This white gold ring is generally set with a large green sapphire. When worn, the ring continually allows a living wearer to heal 1 point of damage per round and an equal amount of ", ". In addition, the wearer is immune to ", " damage while wearing a ", ". If the wearer loses a limb, an organ, or any other body part while wearing this ring, the ring regenerates it as the spell ", ". In either case, only damage taken while wearing the ring is regenerated.", "CONSTRUCTION REQUIREMENTS", "; ", " ", "; ", " 45,000 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Resilience", "info": [" 15,000 gp; ", " ring; ", " 10th; ", " —; ", " moderate ", "DESCRIPTION", "This tarnished copper band sheds its patina when worn by anyone with panache or grit. Whenever the wearer regains a panache or grit point through her actions (not just a daily refresh), she can try to end a single ongoing condition affecting her, attempting a new saving throw against the original DC. The effect must be one that allowed a saving throw, can be removed by either ", " or ", ", and be an effect against which the wearer failed her initial saving throw. If the wearer succeeds at the new save, the effect is removed even if succeeding at the save would normally have other consequences, and even if the effect normally requires multiple saves to remove. If the effect allowed more than one type of saving throw, use the type and DC for the first saving throw the wearer failed for the effect. ", "The wearer can use the ring only once for each ongoing condition. As the wearer must regain a panache or grit point to reroll a save, the ring provides no benefit if she hasn’t used any grit or panache.", "CONSTRUCTION REQUIREMENTS", " 7,500 gp; ", " ", "; ", " ", "; ", " creator must be a grit or panache user", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Retribution", "info": [" strong ", "; ", " 13th; ", " ring; ", " 15,000 gp; ", " —", "DESCRIPTION", "Once per day, the wearer of this charred bone ring may, as an ", ", cause it to detonate in a 30-foot-radius burst that deals 10d6 points of fire damage (", " DC 14 half). If the wearer is killed by the detonation, all magical equipment he carries must also save or take fire damage, and all non-magical equipment takes this damage with no saving throw. This explosion never destroys the ring.", "CONSTRUCTION REQUIREMENTS", " ", ", ", ", ", "; ", " 7,500 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Retreat", "info": [" 12,000 gp; ", " ring; ", " 12th ", " -; ", " strong ", "DESCRIPTION", "Each of these silver-and-gemstone rings is attuned to a specific elf gate.", "Its gemstone always matches the gate’s portal-key. On command once per week, the ring teleports its wearer back to that gate, as per ", ". Theoretically, a ring of retreat could be crafted instead to transport the wearer to a specific site of import, such as a temple or stronghold, but to date, these rings have been crafted only with elf gates in mind.", "CONSTRUCTION REQUIREMENTS", " 6,000 gp; ", " ", "; ", " ", " © 2017, Paizo Inc.; Authors: Benjamin Bruck, John Compton, Crystal Frasier, Tim Hitchcock, Jenny Jarzabski, Isabelle Lee, Joe Pasini, Jessica Price, David Schwartz, and Josh Vogt."]},
{"name": "Ring of Return", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 33,600 gp; ", " —", "DESCRIPTION", "Three times per day, the wearer of the ring can, as a move action, use it to form a link with the particular 5-foot square she occupies at that moment. This causes one of the stones on the ring to glow. As a ", ", the wearer of the ring can ", " to any unoccupied linked square within 100 feet.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 16,800 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Revelation", "info": [" moderate varied; ", " 11th; ", " ring; ", " 10,000 gp (lesser), 16,000 gp (greater), 24,000 gp (superior); ", " —", "DESCRIPTION", "A ", " is a divine item attuned to a particular oracular mystery and containing a revelation associated with that mystery (see the ", " class description). While wearing the ring, an oracle has access to that revelation and may use it as if she had it as a normal class feature. The oracle must have the appropriate mystery to use the ring, and must meet the level requirements (if any) of the revelation itself; for example, a ", " (combat healer) is only usable by an oracle of at least 7th level with the ", ". If the oracle already has that revelation and the revelation gives an ability with a limited number of uses per day, the oracle can use that ability one additional time per day. The ring has no effect if worn by a non-oracle, and ", " doesn’t allow a character to gain a revelation from this ring.", "A ", " contains a revelation that has no level prerequisite or a prerequisite that is less than 6th level. A ", " contains a revelation that requires the oracle to be 7th level or higher. A ", " contains a revelation that requires the oracle to be 11th level or higher.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must be an ", " with the desired revelation; ", " 5,000 gp (lesser), 8,000 gp (greater), 12,000 gp (superior).", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Sacred Mistletoe", "info": [" faint ", "; ", " 1st; ", " ring; ", " 6,000 gp; ", " —", "DESCRIPTION", "This tiny ring of living mistletoe coils about the wearer’s finger of its own accord. The wearer gains a +2 ", " on ", ", ", " (nature), and ", " checks, and a wearer with the ", " ability can move effortlessly, without harm or impediment, even through magically created or manipulated plants. This does not allow the wearer to move through solid objects or creatures.", "Furthermore, the wearer can use ", " once per day.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 3,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Safe Passage", "info": [" 16,000 gp; ", " ring; ", " 10th; ", " —; ", " moderate ", "DESCRIPTION", " are ", " bands capped with a stone sigil keyed to interact with devices and traps within storehouses of ancient history and family wealth.", "EFFECTS", "The ring grants its wearer ", " 10.", "Three times per day as a ", ", the wearer can make himself undetectable by crafted and magical traps and creatures of the ", " type for the following minute. This functions like greater ", " within these limits and also prevents the character’s weight or presence from triggering traps.", "CONSTRUCTION REQUIREMENTS", " 8,000 gp; ", " ", "; ", " ", ", ", " © 2017, Paizo Inc.; Authors: Thurston Hillman, with Paris Crenshaw, Crystal Frasier, Patchen Mortimer, and Kalervo Oikarinen."]},
{"name": "Ring of Shooting Stars", "info": [" strong ", "; ", " 12th; ", " ring; ", " 50,000 gp; ", " —", "DESCRIPTION", "This ring has two modes of operation: one for when the wearer is in ", " or outdoors at night, and a second one when the wearer is underground or indoors at night.", "At night or in areas of shadow or darkness, the ", " can perform the following functions on command.", "The first special function, ball lightning, releases one to four balls of lightning (ring wearer’s choice). These glowing globes resemble ", ", and the wearer controls them similarly (see the ", " spell description). The spheres have a 120-foot range and a duration of 4 rounds. They can be moved at 120 feet per round. Each sphere is about 3 feet in diameter, and any creature who comes within 5 feet of one causes its charge to dissipate, taking electricity damage in the process according to the number of balls created.", "Once the ball lightning function is activated, the balls can be released at any time before the sun rises. Multiple balls can be released in the same round.", "The second special function produces three shooting stars that can be released from the ring each week, simultaneously or one at a time. Upon impact, they deal 12 points of damage and spread (as a ", ") in a 5-foot-radius sphere that deals 24 points of fire damage.", "Any creature struck by a shooting star takes full damage from the impact plus full fire damage from the spread unless it succeeds at a DC 13 ", " save. Creatures not struck but within the spread ignore the impact damage and take only half damage from the fire spread on a successful DC 13 ", " save. The range is 70 feet, at the end of which the shooting star explodes unless it strikes a creature or object before that. A shooting star always follows a straight line, and any creature in its path must make a successful DC 13 ", " save or be hit by the projectile.", "Indoors at night, or underground, the ", " has the following properties.", "The spark shower is a flying cloud of sizzling purple sparks that fan out from the ring for a distance of 20 feet in an arc 10 feet wide. Creatures within this area take 2d8 points of damage each if not wearing metal armor or carrying metal weapons. Any creature wearing metal armor and/or carrying a metal weapon takes 4d8 points of damage.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", ", ", "; ", " 25,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Spell Knowledge", "info": [" moderate or strong (no school); ", " 7th; ", " ring; ", " 1,500 gp (Type I), 6,000 gp (Type II), 13,500 gp (Type III), 24,000 gp (Type IV); ", " —", "DESCRIPTION", "This ring comes in four types: ", ", ", ", ", ", and ", ". All of them are useful only to spontaneous arcane spellcasters.", "Through study, the wearer can gain the knowledge of a single spell in addition to those allotted by her class and level. A ", " can hold 1st-level spells only, a ", " 1st- or 2nd-level spells, a ", " spells of 3rd level or lower, and a ", " up to 4th-level spells.", "A ", " is only a storage space; the wearer must still encounter a written, active, or cast version of the spell and succeed at a DC 20 ", " check to teach the spell to the ring. Thereafter, the arcane spellcaster may cast the spell as though she knew the spell and it appeared on her class’ spell list.", "Arcane spells that do not appear on the wearer’s class list are treated as one level higher for all purposes (storage and casting).", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must be able to cast spells of the spell level to be granted; ", " 750 gp (Type I), 3,000 gp (Type II), 6,750 (Type III), 12,000 gp (Type IV).", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Spell Storing", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 50,000 gp; ", " —", "DESCRIPTION", "A ", " contains up to 5 levels of spells (either divine or arcane, or even a mix of both spell types) that the wearer can cast. Each spell has a caster level equal to the minimum level needed to cast that spell. The user need not provide any ", " or focus to cast the spell, and there is no ", " for wearing armor (because the ring wearer need not gesture). The activation time for the ring is the same as the ", " for the relevant spell, with a minimum of 1 ", ".", "For a randomly generated ring, treat it as a ", " to determine what spells are stored in it. If you roll a spell that would put the ring over the five-level limit, ignore that roll; the ring has no more spells in it.", "A spellcaster can cast any spells into the ring, so long as the total spell levels do not add up to more than 5. Metamagic versions of spells take up storage space equal to their spell level modified by the ", ". A spellcaster can use a ", " to put a spell into the ", ".", "The ring magically imparts to the wearer the names of all spells currently stored within it.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 25,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Spell Storing, Major", "info": [" strong ", "; ", " 17th; ", " ring; ", " 200,000 gp; ", " —", "DESCRIPTION", "As the ", ", except it holds up to 10 levels of spells.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 100,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Spell Storing, Minor", "info": [" faint ", "; ", " 5th; ", " ring; ", " 18,000 gp; ", " —", "DESCRIPTION", "As the ", ", except it holds up to 3 levels of spells.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 9,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Spell Turning", "info": [" strong ", "; ", " 13th; ", " ring; ", " 100,000 gp; ", " —", "DESCRIPTION", "Up to three times per day on command, this simple platinum band automatically reflects the next nine levels of spells cast at the wearer, exactly as if ", " had been cast upon him.", "CONSTRUCTION REQUIREMENTS", ", ", "; ", " 50,000 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring of Splendid Security", "info": [" strong ", "; ", " 16th; ", " ring; ", " 180,000 gp; ", " — lbs. ", "DESCRIPTION", "This extravagant ring is heavy with precious jewels. Even were the ring itself not magical, it would be worth thousands.", "As fashions go in and out of style (or as your fancy shifts), you can alter the appearance of your ", ", clothing, and even weaponry as you see fit at will as a standard action; this change is illusory and does not affect the actual abilities of gear or weapons (although drastic changes in size are beyond the scope of this ability).", "A ", "’s primary purpose, though, is to grant you protection from harm. As long as it is worn, the ring grants you a +5 ", " to AC, a +5 ", " on ", ", and ", " 22.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", " or ", ", ", "; ", " 90,000 gp", "Pathfinder 12: Crown of Fangs. Copyright 2008, Paizo Publishing LLC. Author: Tito Leati"]},
{"name": "Ring of Starlight", "info": [" 1,600 gp; ", " ring; ", " 1st ", " —; ", " faint ", "APPEARANCE", "This smooth ", " ring glimmers with light, and a close look reveals the reflection of a starry night sky within the silvery metal.", "EFFECTS", "The wearer of a ring of starlight can cause portions of her body or items in her possession to glow with colorful light, as per ", ", by waving the hand adorned with the ring over the item or body part as a ", ". This glow lasts for 1 hour, until dismissed as a ", ", or until the ring is removed. This duration need not be used all at once, but must be used in 10-minute increments. (Each time an increment of duration is used, the wearer can choose the portion of her body or item in her possession that glows.) In addition, wearing the ring allows the caster to use ", " on command three times per day as a ", ".", "CONSTRUCTION REQUIREMENTS", " 800 gp; ", " ", "; ", " ", ", ", " © 2018, Paizo Inc.; Authors: John Compton, Eleanor Ferron, Thurston Hillman, Nathan King, Isabelle Lee, Jacob W. Michaels, Adrian Ng, David N. Ross, and Mike Welham."]},
{"name": "Ring of Strength Sapping", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 8,000 gp; ", " —", "DESCRIPTION", "This ring is made of black steel and is eerily cold to the touch. Once per day as a ", ", when the wearer hits a living creature with an unarmed attack, the target must succeed at a DC 20 ", " saving throw or take 1d4 point of ", " ", " in addition to the attack’s normal damage. If the target of the attack takes any Strength damage from this attack, the ring’s wearer gains a +2 ", " to her ", " for 1 minute.", "CONSTRUCTION REQUIREMENTS", " ", ", ", ", ", "; ", " 4,000 gp.", "Pathfinder Roleplaying Game: Ultimate Equipment (OGL) © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors (see page 387)"]},
{"name": "Ring of Summoning Affinity (Aeon)", "info": [" 7,800 gp; ", " ring; ", " 5th; ", " —; ", " faint ", "DESCRIPTION", "This ring is forged from black iron and shining silver. If the wearer can cast ", " spells, he adds ", " to the 3rd-level list of monsters he can ", ", adds ", " to the 6th-level list, and adds ", " to the 9th-level list. Also, once per day the wearer ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,900 gp; ", " ", "; ", " ", " or ", "; ", " creator must be neutral with no other ", " ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Agathion)", "info": [" 7,700 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [good]", "DESCRIPTION", "This ring is forged from electrum and inlaid with runes. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters she can ", " with those spells, adds ", " to the 5th-level list, adds ", " to the 7th-level list, and adds ", " to the 8th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,850 gp; ", " ", "; ", " ", " or ", "; ", " creator must be neutral good", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Angel)", "info": [" 7,200 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [good]", "DESCRIPTION", "This ring is cut from transparent crystal. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters she can summon with those spells, adds ", " to the 7th-level list, and adds ", " to the 8th-level list. Also, once per day on command the wearer can use this ring to summon a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,600 gp; ", " ", "; ", " ", " or ", "; ", " creator must be good", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Archon)", "info": [" 7,000 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [good, law]", "DESCRIPTION", "This ring is made of hammered steel. If the wearer can cast ", " spells, the wearer adds harbingers to the 3rd-level list of monsters he can ", " with those spells, adds legion ", " to the 6th-level list, and adds ", " to the 7th-level list. Also, once per day on command the wearer can use this ring to ", " a harbinger, as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,500 gp; ", " ", "; ", " ", " or ", "; ", " creator must be neutral good", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Asura)", "info": [" 7,600 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [evil, law]", "DESCRIPTION", "This ring is made of intricately marked brass. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters he can ", " with those spells, adds ", " to the 6th-level list, adds ", " to the 7th-level list, and adds ", " to the 8th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,800 gp; ", " ", "; ", " ", " or ", "; ", " creator must be lawful evil", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Daemon)", "info": [" 10,600 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [evil]", "DESCRIPTION", "This ring is carved from bone. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters she can ", " with those spells, adds ", " to the 5th-level list, adds ", " to the 6th-level list, adds luekodaemon and ", " to the 7th-level list, adds ", " and ", " to the 8th level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 5,300 gp; ", " ", "; ", " ", " or ", "; ", " creator must be neutral evil", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Div)", "info": [" 9,100 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [chaos, evil]", "DESCRIPTION", "This ring is shaped to resemble a ", " consuming its own tail. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters he can ", " with those spells, adds ", " to the 4th-level list, adds ", " to the 6th-level list, adds ", " to the 7th-level list, adds ", " to the 8th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 4,550 gp; ", " ", "; ", " ", " or ", "; ", " creator must be chaotic evil", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Inevitable)", "info": [" 8,100 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [law]", "DESCRIPTION", "This ring resembles a gear or cog. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters she can ", " with those spells, adds ", " to the 7th-level list, adds ", " to the 8th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " an ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 4,050 gp; ", " ", "; ", " ", " or ", "; ", " creator must be lawful neutral", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Kyton)", "info": [" 7,300 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [evil, law]", "DESCRIPTION", "This iron ring has several sharp barbs. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters he can ", " with those spells, adds ", " to the 7th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " an ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,650 gp; ", " ", "; ", " ", " or ", "; ", " creator must be lawful evil", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Protean)", "info": [" 7,200 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [chaos]", "DESCRIPTION", "This ring is made from an opalescent material that is never the same color twice. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters she can ", " with those spells, adds ", " to the 6th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,600 gp; ", " ", "; ", " ", " or ", "; ", " creator must be ", " neutral", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Psychopomp)", "info": [" 7,600 gp; ", " ring; ", " 5th; ", " —; ", " faint ", "DESCRIPTION", "This silver ring is marked with a skull emblem. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters he can ", " with those spells, adds ", " to the 4th-level list, adds ", " to the 6th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 3,800 gp; ", " ", "; ", " ", " or ", "; ", " creator must be neutral with no other ", " ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Summoning Affinity (Qlippoth)", "info": [" 8,600 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " [chaos, evil]", "DESCRIPTION", "This ring has an odd, disquieting texture that always reveals greater layers of complexity the more closely it is examined. If the wearer can cast ", " spells, the wearer adds ", " to the 3rd-level list of monsters he can ", " with those spells, adds ", " to the 6th-level list, adds ", " to the 7th-level list, adds ", " to the 8th-level list, and adds ", " to the 9th-level list. Also, once per day on command the wearer can use this ring to ", " a ", ", as if by the ", " spell.", "CONSTRUCTION REQUIREMENTS", " 4,300 gp; ", " ", "; ", " ", " or ", "; ", " creator must be chaotic evil", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Sustenance", "info": [" faint ", "; ", " 5th; ", " ring; ", " 2,500 gp; ", " —", "DESCRIPTION", "This ring continually provides its wearer with life-sustaining nourishment. The ring also refreshes the body and mind; its wearer needs only sleep 2 hours per day to gain the benefit of 8 hours of sleep. This allows a spellcaster that requires rest to prepare spells to do so after only 2 hours, but this does not allow a spellcaster to prepare spells more than once per day. The ring must be worn for a full week before it begins to work. If it is removed, the owner must wear it for another week to reattune it to himself.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 1,250 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Swarming Stabs", "info": [" faint ", "; ", " 5th; ", " ring; ", " 6,000 gp; ", " —", "DESCRIPTION", "This ring is crafted of hardened leather strips, into which bits of fur, feathers, bone, and ivory have been woven.", "Twice per day, when the wearer is ", " an opponent, he can as a ", " deal an additional 1d6 points of damage on a successful melee attack against that opponent. This is a ", " for any effects that reduce or negate such damage.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " creator must be able to ", "; ", " 3,000 gp"]},
{"name": "Ring of Swimming", "info": [" faint ", "; ", " 2nd; ", " ring; ", " 2,500 gp; ", " —", "DESCRIPTION", "This silver ring usually has fishlike designs and motifs etched into the band. It continually grants the wearer a +5 ", " on ", " checks.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have 5 ranks in ", "; ", " 1,250 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Swimming, Improved", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 10,000 gp; ", " —", "DESCRIPTION", "As a ", ", except it grants a +10 ", " on its wearer’s ", " checks.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have 10 ranks in ", "; ", " 5,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Tactical Precision", "info": [" moderate ", "; ", " 3rd; ", " ring; ", " 11,000 gp; ", " —", "DESCRIPTION", "This steel ring is inlaid with adamantine swords and shields.", "The wearer gains a +5 ", " on ", " (soldier) checks, and anytime the wearer gives or receives a numeric bonus from a ", " or the ", " action, that bonus increases by +1. By wearing the ring for 1 hour, a creature may imbue it with a teamwork feat he knows for 24 hours. During this time, any creature wearing the ring may use that feat when cooperating with the creature that imbued it, but not with other creatures even if they possess the same teamwork feat. If the ring is imbued with a new teamwork feat, it replaces the previous feat.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " creator must have 5 ranks of ", " (soldier) and at least one ", "; ", " 5,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Telekinesis", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 75,000 gp; ", " —", "DESCRIPTION", "This ring, knotted with metallic tendrils encasing a setting of red and amber gemstones, allows the caster to use the spell ", " on command, lifting and manipulating objects at a distance using only her mind.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 37,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Terrible Cost", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 20,000 gp; ", " —", "DESCRIPTION", "These rings once displayed the smiling face of a former king, and were forged in limited quantities to celebrate the end of his reign. As the years passed by, the rings were cast aside or lost. Recently, several resurfaced, but changed by unknown means— the former king’s face now bears a sorrowful expression, and flames loom behind him.", "As a ", ", you may charge the ring with a +1 ", " by sacrificing 2 of your ", ". These ", " remain lost and cannot be healed by any means until the ring’s power is expended. You may do this multiple times, up to a maximum of a +5 ", " stored in the ring.", "As an ", ", you can add the stored ", " to any single ", ", damage roll, skill check, or ", ", which expends the charged energy from the ring. You must declare this use after rolling the die but before you learn the result of the roll. You must expend all the ring’s power at once. Once the charge is expended, you can heal your lost ", " normally. Expending this charge does not ruin the ring, and you may charge it again by sacrificing more ", ".", "The charge in the ring can come from multiple donors, but none of the donors can regain their sacrificed ", " until the ring’s charge is spent or the ring is destroyed. For this reason, owners of a ", " guard the item carefully.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", "; ", " 10,000 gp", " Copyright 2009, Paizo Publishing, LLC Authors: Jonathan H. Keith, Colin McComb, Steven E. Schend, Leandra Christine Schneider, and Amber E. Scott"]},
{"name": "Ring of the Beast", "info": [" faint ", "; ", " 5th; ", " ring; ", " 8,000 gp; ", " –", "DESCRIPTION", "Three types of rings of the beast exist; all three appear as yellowed bone carved in the shapes of wild beasts devouring ", "CONSTRUCTION REQUIREMENTS", "Forge Ring, ", "or ", " (", "); ", " 4,000 gp", ". © 2011, Paizo Publishing, LLC. Authors: Erik Mona, Mark Moreland, Russ Taylor, and Larry Wilhelm."]},
{"name": "Ring of the Ecclesiarch", "info": [" faint ", "; ", " 5th; ", " ring; ", " 28,500 gp; ", " —", "DESCRIPTION", "This ornate ring of sanctified silver is engraved with a golden signet that incorporates the holy symbol of the wearer’s deity after being worn for 24 hours. The ring can be used to seal parchments or to mark any surface as the ", " spell at will. The wearer is marked as a scholarly leader of the faith and gains a +5 ", " on ", " and ", " (religion) checks. If the wearer has the ", " feat, she may attract double the normal number of followers, and her followers’ zealous devotion grants them a +4 ", " on ", " saves against ", " spells and effects.", "Once per day, the wearer of the ring can use ", " and ", ", often using the latter power to speak and observe through portraits, statues, and even minted coinage bearing their likeness.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", ", ", "; ", " creator must have 5 ranks of ", " and ", " (religion) and the ability to cast divine spells; ", " 14,250 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of the Faithful Dead", "info": [" 1000 gp; ", " ring; ", " 3rd; ", " —; ", " faint ", "DESCRIPTION", "This spiraling silver ring glows briefly when a living creature puts it on. If its wearer of a ring of the faithful ", " is slain by a creature with the create spawn ability, the wearer does not rise as an ", " creature, even if the ring is later removed. If a corpse is wearing a ring of the faithful ", ", any attempts to create an ", " creature from the corpse (such as via ", ") automatically fail, though simply removing the ring ends this protection.", "CONSTRUCTION REQUIREMENTS", " 500 gp; ", " ", "; ", " ", " © 2016, Paizo Inc.; Authors: Robert Brookes, Liz Courts, Mikko Kallio, Jeffrey Swank, and Larry Wilhelm."]},
{"name": "Ring of the Godless", "info": [" varies (+1 bonus 8,000 gp, +2 bonus 17,000 gp, +3 bonus 27,000 gp, +4 bonus 38,000 gp, +5 bonus 50,000 gp); ", " ring; ", " 5th; ", " —; ", " faint ", " and ", "DESCRIPTION", "These rings are said to have first been forged to help root out the hidden faithful and other practitioners of the divine.", "A ring of the godless grants a ", " on saving throws against divine spells. This bonus does not apply to ", " or ", " abilities unless they are class abilities of a divine spellcasting class, such as ", " or domain powers, or unless they are used by a creature that has been ", ", created, or summoned by divine magic. The wearer’s ", " (if any) increases by an amount equal to the ring’s ", ", though this increase applies only against divine spells (and ", " as described above).", "A ring of the godless also allows the wearer to use ", " at will, though it detects only divine magic. In addition, the wearer can use a specialized form of ", " a number of times per day equal to the ring’s ", ". This ability can be activated as a ", ", its effect lasts until the end of the wearer’s turn, and it detects only divine magic or divine spellcasting ability.", "CONSTRUCTION REQUIREMENTS", " varies (+1 bonus 4,000 gp, +2 bonus 8,500 gp, +3 bonus 13,500 gp, +4 bonus 19,000 gp, +5 bonus 25,000 gp); ", " ", "; ", " ", ", ", ", ", "; ", " creator cannot be a divine spellcaster and must be of a level at least three times higher than the bonus of the ring.", " © 2013, Paizo Publishing, LLC; Authors: Shaun Hocking, Rob McCreary, and Jason Nelson."]},
{"name": "Ring of the Grasping Grave", "info": [" faint ", "; ", " 1st; ", " ring; ", " 2,000 gp; ", " —", "DESCRIPTION", "The wearer of this ring can make a melee ", " against an ", " creature no more than one size category larger than himself, cutting off that creature from undying energy. The wearer never suffers any ill effects that might normally occur from coming into physical contact with an undead creature touched in this way. On a successful hit, the undead cannot be healed or aided by the effects of negative energy for 1d4 rounds. During this duration, positive energy affects the undead creature normally.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 1,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of the Maker", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 1,200 gp; ", " —", "DESCRIPTION", "The wearer of the ring gains ", " 10 against the first fire attack that hits him that day. This protection renews itself every morning at dawn. In addition, the wearer receives a +1 ", " on saves made against fire spells and effects. The ring must be worn for 24 hours to have any effect.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 600 gp.", "GameMastery Module D0: Hollow’s Last Hope, Copyright 2007 Paizo Publishing, LLC. Author: Jason Bulmahn and F. Wesley Schneider."]},
{"name": "Ring of the Ram", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 8,600 gp; ", " —", "DESCRIPTION", "The ring of the ram is an ornate ring forged of hard metal, usually iron or an iron alloy. It has the head of a ram as its device. The wearer can command the ring to give forth a ram-like force, manifested by a vaguely discernible shape that resembles the head of a ram or a goat. This force strikes a single target, dealing 1d6 points of damage if 1 charge is expended, 2d6 points if 2 charges are used, or 3d6 points if 3 charges (the maximum) are used. Treat this as a ranged attack with a 50-foot maximum range and no penalties for distance.", "The force of the blow is considerable, and those struck by the ring are subject to a ", " if within 30 feet of the ring-wearer. The ram is Large and uses the ring’s caster level as its ", " with a ", " of 25. This gives the ram a ", " of +17. The ram gains a +1 bonus on the ", " attempt if 2 charges are expended, or +2 if 3 charges are expended.", "In addition to its attack mode, the ring of the ram also has the power to open doors as if it were a character with ", " 25. This expends 1 charge. If 2 charges are expended, the effect is equivalent to a character with ", " 27. If 3 charges are expended, the effect is that of a character with ", " 29.", "A newly created ring has 50 charges. When all the charges are expended, the ring becomes a nonmagical item.", "CONSTRUCTION REQUIREMENTS", "; ", " ", ", ", "; ", " 4,300 gp", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of the Sea Strider", "info": [" moderate ", "; ", " 7th; ", " ring; ", " 14,000 gp; ", " —", "DESCRIPTION", "The ring grants its wearer a swim speed of 30 feet, as well as +8 racial bonus on ", " checks for having a swim speed. Furthermore, once per day as a ", ", as long as the wearer is in contact with liquid, he can use ", " as the spell, but its starting and ending points must be connected by a contiguous mass of liquid.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 7,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of The Shadow Victim", "info": [" 101,000 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "This smooth, lusterless gray ring is crafted of dark glass and has the image of a body carved into its band. Once per day, the wearer of this ring can perform a complex mental and verbal ritual, repeatedly whispering the ring’s command word, while touching any ", " corpse that has been ", " for less than 1 week. The creature must have had 7 ", " or fewer in life. This ritual can be as short as 1 round or could last up to 24 hours. It requires both total focus and constant contact between the ring, the wearer, and the target corpse. Interruption of any kind spoils the ritual, requiring the wearer to begin anew. The wearer of the ring chooses how long this ritual will last, but that decision must be made before she begins the ritual.", "On the ritual’s completion, an illusory duplicate of the creature touched—partially real and formed of animate ice cloaked in magical shadow—springs into existence. This functions as ", " in all ways unless stated otherwise. The wearer of this ring gains a +10 bonus on the ", " check when performing this ritual. The shadow creature appears in all ways to be hearty and full of life, equipped with all of the gear and clothing that was carried or worn by the corpse throughout the ritual. At the same moment the shadow creature is completed, the targeted corpse and all of its attendant equipment vanishes, melting away like snow.", "The false creature brought into existence by the ring of the shadow victim has the same base ability scores, type, and subtype as the targeted corpse. It appears in all ways to be the same individual as the corpse touched, and it retains the general personality, attitude, abilities, and intellect of that creature.", "However, this duplicate doesn’t possess any memories that the wearer of the ring doesn’t also possess, has no ", " or ", " abilities, can’t use activated ", ", can’t gain the benefits of ", ", can’t gain levels or increase its abilities, and can’t have more than 3 ", ".", "This false creature behaves much like the target did in life, except it has a starting attitude of helpful toward the ring’s wearer and is generally willing to assist the wearer in any endeavor. The shadow creature will take nearly any action to aid the wearer of the ring, including dangerous, foolish or suicidal actions. This semi-illusory creature remains in existence for a duration equal to 7 × the length of the initial ritual that created it, until the wearer removes the ring of the shadow victim, until the wearer activates the ring again, or until the creature is destroyed by violence, whichever comes first. At that time, the duplicate vanishes and the original corpse, unchanged from when the initial ritual was completed, appears in its place.", "CONSTRUCTION REQUIREMENTS", " 50,500 gp; ", " ", "; ", " ", ", ", ", ", " © 2016, Paizo Inc.; Authors: Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."]},
{"name": "Ring of the Sophisticate", "info": [" moderate ", " and ", "; ", " 8th; ", " ring; ", " 11,000 gp; ", " —", "DESCRIPTION", "Often worn on the little finger, this ring grants its wearer a +4 ", " on ", " and ", " (local) checks. Also, once per day on command, the wearer can use the ring to cast either ", " or ", " (the wearer’s choice). Furthermore, on command and at will, the wearer can instantly know the direction from herself to the nearest tavern, pub, or similar watering hole as long as that establishment is in a settlement whose population is equivalent to that of a village or greater and that is within 20 miles of the wearer.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", "; ", " creator must have at least 4 ranks in both ", " and ", " (local); ", " 5,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of the Troglodyte", "info": [" faint ", "; ", " 5th; ", " ring; ", " 12,000 gp; ", " —", "DESCRIPTION", "Two times per day on command, the wearer of this ring can produce a horrific smell affecting all living creatures other than the wearer within a 10-foot radius. Once created, the smell remains, centered on the wearer, until she dismisses it as a ", ". This is a ", " effect. ", "Any creature affected by the disgusting aroma produced by the ring must succeed at a DC 14 ", " saving throw when it starts its turn in the ring’s stench radius. Those that fail a saving throw become ", " for 1 round. If they are already sickened, they become ", " for 1 round instead.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 6,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Three Wishes", "info": [" strong universal; ", " 20th; ", " ring; ", " 120,000 gp; ", " —", "DESCRIPTION", "This ring is set with three rubies. Each ruby stores a ", " spell, activated by the ring. When a ", " is used, that ruby disappears. For a randomly generated ring, roll 1d3 to determine the remaining number of rubies. When all the wishes are used, the ring becomes a non-magical item.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", " or ", "; ", " 97,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Transposition", "info": [" moderate ", "; ", " 10th; ", " ring; ", " 10,800 gp; ", " —", "DESCRIPTION", "On command, the wearer of this ring can touch it to another ring, magical or mundane, and bind it to the ring of transposition.", "Once per day, the wearer of the ring of transposition can speak a ", " to exchange places with the creature wearing the bonded ring, which must be within 800 feet, as though using a ", " spell against a willing target. In the process, the ring of transposition trades places with the ring on the other creature’s hand, and the bond between the rings is broken. ", "The bonding property of the ring of transposition can be used as often as desired, breaking any existing bond each time it is used. An existing bond can be broken by a successful ", " check against the ", " of the ring.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 5,400 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Vengeful Blood Magic", "info": [" 5,400 gp; ", " ring; ", " 11th; ", " —; ", " moderate ", "DESCRIPTION", "This claw ring is made of red metal tinged with orange, and a long nail made of obsidian extends from the tip. It allows its wearer to cast a spell as an ", ". Three time per day, if the wearer is bloodraging and a foe provokes an ", " from him, the wearer can cast a spell with a ", " of 1 ", " or less as the ", ". The spell must target the creature that provoked the attack or include it in the spell’s area, and must be no higher than 3rd level. This counts as one of the wearer’s ", " for the round; casting this spell does not itself provoke an ", ".", "CONSTRUCTION REQUIREMENTS", " 2,700 gp; ", " ", ", ", "; ", " © 2014, Paizo Inc.; Authors: Dennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."]},
{"name": "Ring of Water Walking", "info": [" moderate ", "; ", " 9th; ", " ring; ", " 15,000 gp; ", " —", "DESCRIPTION", "This ring is often made of coral or bluish metal decorated with motifs depicting rolling waves of water. The ring allows the wearer to continually utilize the effects of the spell ", ".", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 7,500 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of Wizardry", "info": [" moderate (no school); ", " 11th; ", " ring; ", " 20,000 gp (Type I), 40,000 gp (Type II), 70,000 gp (Type III), 100,000 gp (Type IV); ", " —", "DESCRIPTION", "This special ring comes in four varieties, all of them useful only to arcane spellcasters. The wearer’s arcane spells per day are doubled for one specific spell level. A ", " I doubles 1st-level spells, a ", " II doubles 2nd-level spells, a ", " III doubles 3rd-level spells, and a ", " IV doubles 4th-level spells. Bonus spells from high ability scores or school specialization are not doubled.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 10,000 gp (Type I), 20,000 gp (Type II), 35,000 gp (Type III), 50,000 gp (Type IV).", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Ring of X-Ray Vision", "info": [" moderate ", "; ", " 6th; ", " ring; ", " 25,000 gp; ", " —", "DESCRIPTION", "On command, this ring gives its wearer the ability to see into and through solid matter. Vision range is 20 feet, with the viewer seeing as if he were looking at something in normal light even if there is no illumination. X-ray vision can penetrate 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood or dirt. Thicker substances or a thin sheet of lead blocks the vision.", "Using the ring is exhausting, causing the wearer 1 point of ", " damage per minute after the first 10 minutes of use in a single day. The ring must be used in 1-minute increments.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 12,500 gp", ". Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."]},
{"name": "Ring, Elemental", "info": [" 30,000 gp; ", " ring; ", " 15th; ", " 1 lb.; ", " strong ", "DESCRIPTION", "This ornate ring has a thick iron band covered in sigils of calling, and is set with a large glowing gemstone that appears to be an ", ". The ring serves as a gateway for a specific elder ", " (25% chance each for air, earth, fire, or water) that performs a narrow range of services when called.", "When activated with a command word, the ", " is called (as by ", ") and demands to know what service it is to perform. It can only be commanded to protect a specific creature or object, attack a specific creature, damage a specific object, or answer questions about its home plane.", "The wearer of the ring is able to communicate with the elder elemental as if they shared a common language. The elder elemental serves for no more than 24 hours, after which it returns to its home plane and the ring become a valueless hunk of lead.", "CONSTRUCTION REQUIREMENTS", " 15,000 gp; ", " ", "; ", " ", ", ", " © 2015, Paizo Inc.; Authors: Brian Duckwitz, Philip Minchin, and Jason Nelson."]},
{"name": "Ring, Maintenance Overseer’s", "info": [" 8,000 gp; ", " ring CL 4th ", " —; ", " faint ", "DESCRIPTION", "This tarnished signet is marked as belonging to a specific city no smaller than a large town, though it functions in any settlement of at least that size.", "EFFECTS", "After spending 5 days in a settlement with the maintenance overseer’s ring equipped, its wearer learns a great deal about the schematics of any sewers, tunnels, basements, and passages beneath the settlement. This knowledge is not necessarily absolute, but allows the wearer to act as though trained in ", " (dungeoneering) when answering questions about the settlement’s underground with a +5 bonus on all such checks.", "A maintenance overseer’s ring also grants the wearer an automatic ", " check to notice secret doors within 10 feet in any area beneath street level of a city to which the ring is attuned. A wearer who already receives a ", " check to perceive a secret door (such as a ", " using stonecunning) rolls her ", " check twice and takes the better result.", "CONSTRUCTION REQUIREMENTS", " 4,000 gp; ", " ", "; ", " ", " © 2015, Paizo Inc.; Authors: John Compton, Mikko Kallio, Nicolas Logue, Michael McCarthy, Mike Myler, and David N. Ross."]},
{"name": "Ring, Scavenger’s", "info": [" 15,000 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "This polished iron band allows the wearer to walk along the ocean floor as easily as on dry land.", "The wearer of a scavenger’s ring sinks to the bottom of any large body of water at a rate of 30 feet per round. Once on the body of water’s floor, the wearer can move and act as though she were on land, allowing her to jump, roll, attack, and run as normal, although she cannot swim (nor can she control her ascent or descent underwater) as long as she wears the ring. As soon as the wearer removes the ring, she may swim as normal and is subject to all the normal penalties associated with underwater action. A scavenger’s ring does not confer the ability to breathe while underwater.", "CONSTRUCTION REQUIREMENTS", " 7,500 gp; ", " ", "; ", " ", " © 2013, Paizo Publishing, LLC; Authors: John Ling, Ron Lundeen, Patrick Renie, David Schwartz, and Jerome Virnich."]},
{"name": "Ring, Wary", "info": [" ring; ", " 9th; ", " —; ", " lawful neutral; ", " 14,600 gp", " lawful good; ", " 60 ft. ", " 12 ", " 15 ", " 12; ", " 7; ", " empathy", "DESCRIPTION", "This relatively plain brass ring of mind shielding can read script in any language. The personality within the ring is distrustful of everyone, and it pesters its wearer with increasingly elaborate conspiracy theories. Because of its unrelenting paranoia, the ring provides its wearer with occasional well-timed guidance and can use ", " up to three times per day on the wearer.", "CONSTRUCTION REQUIREMENTS", " ", " ", " ", ", ", ", ", "; ", " 7,300 gp", " © 2013, Paizo Publishing, LLC; Authors: John Ling, Ron Lundeen, Patrick Renie, David Schwartz, and Jerome Virnich."]},
{"name": "Rings of Alien Geometries", "info": [" 30,000 gp; ", " none; ", " 10th; ", " —; ", " moderate ", "DESCRIPTION", "A short silver chain joins these two crystal rings together. When worn on two adjacent fingers of the same hand, the two rings occupy a single ring slot. Once per day as a ", ", the wearer of a pair of rings of alien geometries can create two shimmering portals, each 5 feet in diameter and surrounded by a 4-inch-thick ring of force. Only one side of each portal functions as a gateway; the other side is blocked (as if by a ", ").", "Each portal must be oriented vertically and be within 30 feet of the wearer at the time of creation.", "Medium or smaller creatures can move through either portal as easily as moving to an adjacent square, stepping out of the other portal. Large creatures can squeeze through but can’t end movement halfway through a portal. Any creature farther than 5 feet away from a portal has no line of sight or line of effect through it to the other portal, but a creature adjacent to one of the portals can attack through it as though the square directly in front of the other portal were adjacent to the creature.", "Both of the portals vanish after 10 rounds. Destroying a portal is possible only with spells or attacks that can destroy a ", ". Destroying one portal causes the other portal to immediately collapse.", "CONSTRUCTION REQUIREMENTS", " 15,000 gp; ", " ", "; ", " ", ", ", " © 2016, Paizo Inc.; Authors: John Bennett, Clinton J. Boomer, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Jim Groves, Steven Helt, Thurston Hillman, Eric Hindley, Brandon Hodge, Mikko Kallio, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Alistair Rigg, Alex Riggs, David N. Ross, F. Wesley Schneider, David Schwartz, Mark Seifter, and Linda Zayas-Palmer."]},
{"name": "Rings of Bondage", "info": [" 18,200 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "These rings are forged in pairs, establishing a mental connection between the two creatures wearing them, designating one as the master and the other as the servant. The listed price and cost are for both rings. Creatures wearing rings of bondage can understand one another’s speech.", "The wearer of the master ring gains a +6 ", " on ", " checks against the servant and is continuously aware of the location and general condition of the wearer of the servant ring, as the ", " spell.", "In addition, once per day, the wearer of the master ring of bondage can impose her will upon the wearer of the servant ring, compelling the servant to perform or refrain from an action as if subjected to a ", " (", " DC 16 negates). Alternatively, this effect can be executed as a contract between the wearers: as long as the wearer of the master ring is a valid target for ", ", she can accept a ", " dictated by the wearer of the servant ring. In such an event, neither wearer is entitled to a saving throw and both are compelled by the ", " to fulfill the terms of the agreement. If the wearer of the servant ring is unwilling to agree to such a contract, she can always select a ", " such as “remove the ", " from me.” As long as a ", " imposed by a ring of bondage remains in effect, neither ring can be removed. If either ring is destroyed, the effects of the ", " remain in place, but the surviving ring can’t create a new ", " until the missing ring is repaired or replaced. If a mutual ", " is accepted and one ", " is ended, both ", " effects end simultaneously.", "A target can have a ring of bondage forcibly placed on its finger, but only if that creature is ", ".", "CONSTRUCTION REQUIREMENTS", " 9,100 gp; ", " ", "; ", " ", ", ", ", ", ", ", ", ", " © 2016, Paizo Inc.; Authors: Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."]},
{"name": "Rings of Bondage, Greater", "info": [" 42,000 gp; ", " ring; ", " 11th; ", " —; ", " moderate ", "DESCRIPTION", "These specialized rings function as rings of bondage, but a command imposed by the wearer of the master ring (including a mutual agreement affecting both wearers) takes 10 minutes to activate, is permanent, and functions as ", ", except a DC 16 ", " save still negates it.", "In addition, the wearer of the master ring gains a continuous ", " (DC 16) effect against the wearer of the servant ring, with a save required for every attack the servant makes against the master (including area attacks, but no save is required when directing allies or controlled creatures to attack the wearer); a failed save prevents only that single attack. Each time the servant successfully attacks the master, he must succeed at a second DC 16 ", " save or be affected as ", ".", "CONSTRUCTION REQUIREMENTS", " 21,000 gp; ", " ", "; ", " ", ", ", ", ", ", ", ", ", ", ", " © 2016, Paizo Inc.; Authors: Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."]},
{"name": "Rings of Friend-Finding", "info": [" 9,000 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "These specialized rings are sold in pairs and help allies find one another. Each of the wearers must wear the rings for 24 hours before they function, after which each wearer can activate her ring of friend-finding as a ", ", enabling her to determine the direction, distance, and general condition of the wearer of the other ring as a ", " spell.", "CONSTRUCTION REQUIREMENTS", " 4,500 gp; ", " ", "; ", " ", ", ", " © 2015, Paizo Inc.; Authors: Brian Duckwitz, Philip Minchin, and Jason Nelson."]},
{"name": "Rings, Contract", "info": [" 8,500 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "Contract rings are crafted in pairs (the price is for both rings), establishing a connection between the wearers. Each wearer must wear their ring for 24 hours before they begin to work.", "Contract rings grant a +10 ", " on ", " checks made against the other wearer, and creatures wearing linked contract rings can understand each other’s language.", "Once per day, Contract rings can seal a contract. The two wearers join hands and willingly state what each is agreeing to. Once both agree, each wearer accepts a ", " (no save) to fulfill the terms of the contract. This function does not occur if either character is under a ", " effect or threat that forces her agreement. This ", " lasts 7 days, starting immediately. While the lesser geas remains in effect, neither wearer can remove her ring, and neither ring can establish another lesser geas. If either ring is destroyed, the effects of any active lesser geas remain for both creatures, but the surviving ring becomes nonfunctional once the lesser geas expires until the missing ring is repaired or replaced. If one wearer’s lesser geas is broken, the other wearer’s is removed.", "CONSTRUCTION REQUIREMENTS", " 4,250 gp; ", " ", "; ", " ", ", ", ", ", " © 2015, Paizo Inc.; Authors: Brian Duckwitz, Philip Minchin, and Jason Nelson."]},
{"name": "Riverclub Ring", "info": [" 1,000 gp; ", " ring; ", " 1st; ", " —; ", " faint ", "DESCRIPTION", "This simple bronze band can transform into a handy weapon in a pinch. When the wearer of a riverclub ring plunges her hand into at least 1 gallon of water as a ", ", she can ", " forth a ", " made of animated water.", "The weapon maintains the shape, solidity, and statistics of a masterwork ", " of the wielder’s size so long as she holds it, dealing damage as normal, except that it deals 1 additional point of damage against creatures with the fire subtype. The ", " turns back into a puddle of water again as soon as the wielder loosens her grip around it.", "CONSTRUCTION REQUIREMENTS", " 500 gp; ", " ", "; ", " ", " © 2014, Paizo Inc.; Authors: Tim Akers, Jason Brick, Ethan Day-Jones, James Jacobs, Nick Salestrom, David Schwartz, and William Thrasher."]},
{"name": "Saltspray Ring", "info": [" 4,500 gp; ", " ring; ", " 5th; ", " —; ", " faint ", " and ", "DESCRIPTION", "Created as an odd experiment to protect civil servants combating fires, a dozen or so of these rings were created and assigned to a fire brigade, but their use fell out of fashion after being implemented for only a little over a year.", "This ", " ring is engraved with a pattern of rolling waves that encircles the entire band. The saltspray ring is immune to rust, both from natural oxidation and rust caused by magical effects.", "EFFECTS", "Upon ", ", the ring causes a thick vapor to continuously surround its owner as per ", ", except the mist has a 10-foot radius from the wearer and the area of effect moves with the wearer. This mist is exceedingly wet and extinguishes all non-magical fires within its area. Magical fires and creatures with the fire subtype are not dispelled or adversely affected by the mist, though such creatures find being in the fog to be an uncomfortable experience. The mist does not permit ", " creatures without the ", " special quality to breathe out of water, but creatures that must remain wet or suffer a negative effect or condition have that requirement satisfied by the ring’s effect. This effect can be dismissed as a ", ". The ring has no effect whatsoever underwater.", "CONSTRUCTION REQUIREMENTS", " 2,250 gp; ", " ", "; ", " ", ", ", " © 2017, Paizo Inc.; Authors: Jim Groves, with Adam Daigle, Isabelle Lee, Luis Loza, and Greg A. Vaughan."]},
{"name": "Scholar’s Ring", "info": [" moderate ", "; ", " 5th; ", " ring; ", " 8,700 gp; ", " —", "DESCRIPTION", "A ", " grants complete understanding of any written text or spoken language, even one that the wearer has never encountered before (as the ", " spell), as well as a +5 ", " on ", " (history) checks.", "In addition, once every 5 days the wearer can invoke a ", " spell related to a subject that she has been studying in the previous week, if she has attempted a ", " (history) check aided by the ring.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 4,350 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Soultether Ring", "info": [" 8,000 gp; ", " ring; ", " 17th; ", " —; ", " strong ", "DESCRIPTION", "When the wearer of this delicate platinum ring dies, his soul does not proceed to its final judgment in Purgatory.", "Until the ", " is removed from the corpse, the time limit for restoring the creature to life via spells such as ", " or ", " is suspended. This ring has no effect if it is placed upon a corpse; it must be worn at the time the creature dies to tether its soul. ", " consider ", " to be sacrilegious, and the creatures destroy the rings whenever possible.", "CONSTRUCTION REQUIREMENTS", " 4,000 gp; ", "; ", " or ", " © 2018, Paizo Inc.; Authors: Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."]},
{"name": "Spiritualist Rings", "info": [" strong ", "; ", " 12th; ", " ring; ", " 70,000 gp; ", " —", "DESCRIPTION", "These four garish and gaudy rings must be worn on one hand, though they take up only a single ring slot. They grant the wearer the ability to commune with and affect the dead in the following ways. The wearer can use ", ", as the spell, three times per day. It takes 10 minutes to use this ability.", "The wearer can use ", ", as the spell, three times per day. The wearer’s weapons gain the ", " weapon special ability while the wearer is wielding the weapons. The wearer gains a +4 ", " or ", " on saving throws against positive and negative energy effects. The bonus depends on the wearer’s ", "—good-aligned wearers gain a sacred bonus, whereas evil-aligned wearers gain a profane bonus. Neutral-aligned wearers pick either a sacred or profane bonus when the ring is first put on, which cannot be changed later.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", "; ", " 45,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Splendorous Ring", "info": [" faint ", "; ", " 3rd; ", " ring; ", " 9,900 gp; ", " — ", "DESCRIPTION", "A splendorous ring is composed of six white and yellow gemstones faceted in a platinum band.", "Three times per day, the wearer of a splendorous ring can twist the ring to cloak himself in an aura of glory. He appears both radiant and terrible, glowing with the might of the heavens. Anyone within 10 feet of the ring when it is activated must succeed at a DC 13 ", " save or be ", " by the wearer’s form as if affected by ", ". 2d4+3 ", " worth of creatures are affected in this way.", "The fascinating effect of the ring lasts for 3 rounds. During that time and for 5 rounds after, the ring’s wearer gains a +2 ", " on any ", " checks or ", "-based skill checks to influence any good-aligned creatures affected by the ring’s ", " effect, and a –2 penalty on any ", " checks or ", "-based skill checks to influence any evil-aligned creatures affected by the ", " effect.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " creator must be good-aligned; ", " 4,950 gp", ". © 2013 Paizo Publishing, LLC; Author: Amber Scott."]},
{"name": "Star Ring", "info": [" ring; ", " 35,000 gp; ", " moderate ", " and ", "; ", " 9th; ", " —", "DESCRIPTION", "This otherwise plain ring is adorned with a tiny star-shaped rune. These rings were given as badges of office and tokens of appreciation—sometimes, they were given as bribes.", "A ", " grants a +3 ", " to AC, a +3 ", " on all saving throws, and protects the wearer with a constant ", " effect.", "At will, as a ", ", the wearer can use the ring to change the appearance of his clothing or armor into any other kind of clothing or armor. The actual clothing and armor worn retain all their properties (including weight) when glamered. Only ", " or similar magic reveals the true nature of the adornments.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", ", ", "; ", " 17,500 gp", " © 2012, Paizo Publishing, LLC; Authors: Wolfgang Baur, Stephen S. Greer, James Jacobs, Nicolas Logue, Richard Pett, and Greg A. Vaughan.", " "]},
{"name": "Steelhand Circle", "info": [" moderate ", "; ", " 8th; ", " ring; ", " 12,000 gp; ", " —", "DESCRIPTION", "When this ring is worn, the wielder’s skin attains a barely perceptible sheen.", "In practical terms, the wearer ignores the first 5 points of an object’s ", " when performing a ", " or when smashing an object. She also does not take the standard —4 penalty for making a ", " check to ", " while unarmed. ", "Additionally, the ring’s wearer can focus all of the ring’s power, possibly repelling a devastating blow. Once per day, when a ", " or ", " is scored on the wearer, there is a 50% chance that the critical hit or sneak attack is negated and damage is instead rolled normally. Using this ability is an ", ", and the wearer must decide to use it before the critical hit or sneak attack damage is rolled.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", ", ", "; ", " 6,000 gp.", " © 2012, Paizo Publishing, LLC; Authors: Dennis Baker, Jesse Benner, Benjamin Bruck, Ross Byers, Brian J. Cortijo, Ryan Costello, Mike Ferguson, Matt Goetz, Jim Groves, Tracy Hurley, Matt James, Jonathan H. Keith, Michael Kenway, Hal MacLean, Jason Nelson, Tork Shaw, Owen KC Stephens, Russ Taylor, and numerous RPG Superstar contributors"]},
{"name": "Survivor’s Ring", "info": [" 56,160 gp; ", " —; ", " ring; ", " 18th; ", " strong ", "DESCRIPTION", "Once per day, if the wearer would be reduced to 0 or fewer ", " but not be ", ", she is instead reduced to 0 ", " and subject to an effect similar to ", ".", "Her illusory double appears to die or to take on the ", " condition in her place, as appropriate for the negated effect. The wearer cannot control the double. In addition, the wearer can ", " the ring’s stone as a ", " once per day to use ", " but only while the ring’s ", " effect is active.", "CONSTRUCTION REQUIREMENTS", " 25,080 gp; ", " ", "; ", " ", ", ", ", ", " © 2016, Paizo Inc.; Authors: David N. Ross, with Ross Byers."]},
{"name": "Swarmwalker’s Ring", "info": [" 26,000 gp; ", " ring; ", " 7th; ", " —; ", " moderate ", "DESCRIPTION", "This shining, ash-white ring of bone is crafted to look like countless interlocking ", " fangs, set with a dozen dark, garnet eyes like those of albino sewer-hunters. The wearer of this ring can utter a command word to call forth 1d3 ", " within 40 feet. These ", " each act immediately and vanish after 7 rounds. They are independent and not under the wearer’s control, though the wearer is immune to the effects and attacks of any ", " created through use of this ring.", "Alternatively, upon command, the ring’s wearer can use ", ". This magical transportation must begin and end in a square that includes a ", " summoned by use of this ring.", "This ring’s abilities can be used a total of three times per day, in any combination. An urban ", " wearing this ring can gain one additional use per day by expending three daily uses of her ", " ability.", "CONSTRUCTION REQUIREMENTS", " 13,000 gp; ", " ", "; ", " ", ", ", " © 2016, Paizo Inc.; Authors: Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."]},
{"name": "Tyrant’s Friend", "info": [" faint ", "; ", " 5th; ", " ring; ", " 3,000 gp; ", " –", "DESCRIPTION", "A slender copper band, a tyrant’s friend is thin enough to be hidden beneath another ring (although it still counts against the limit of magic rings a character can wear). The ring grows noticeably warmer whenever the hand wearing it touches a poisoned or poisonous object or creature (including containers holding poison), warning the wearer of potential danger.", "CONSTRUCTION REQUIREMENTS", " ", "; ", " ", "; ", " 1,500 gp", ". © 2011, Paizo Publishing, LLC. Authors: Erik Mona, Mark Moreland, Russ Taylor, and Larry Wilhelm."]},
{"name": "Witness Hunter’s Ring", "info": [" 25,200 gp; ", " —; ", " ring; ", " 7th; ", " moderate ", "DESCRIPTION", "By concentrating on the ring as a ", ", the wearer learns whether he is being observed and whether it is by one or by more than one creature. Once per day, the wearer can use ", " on command to target creatures that are currently observing him. In addition, the wearer can cast ", " once per day on command.", "CONSTRUCTION REQUIREMENTS", " 12,600 gp; ", " ", "; ", " ", ", ", " © 2016, Paizo Inc.; Authors: David N. Ross, with Ross Byers."]}
]